{
    "Adobe Commerce Business Practitioner - Professional": {
        "type": "course",
        "category": "Adobe Commerce",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "objectives": "This course covers an introduction and overview of all critical components and best practices to provide you with the essential knowledge and skills required to navigate the program for the role of the Business Practitioner. Additionally, the course offers links to supplementary references, resources, and user materials, ensuring you have the necessary guidance to tackle the Certified Business Practitioner Professional exam and excel in your Adobe Commerce journey.",
        "modules": "Introduction, Adobe Commerce Overview, Product Management and Catalog, Customer Experience Management, Order Management, Storefront Customization, Marketing and Promotions, Payments and Shipping, Analytics and Reporting, Security and Compliance, Quiz and Conclusion"
    },
    "Adobe Workfront Project Manager  Professional": {
        "type": "course",
        "category": "Adobe Workfront",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "objectives": "This learning program is specifically designed to provide new and beginning users with a fast start in learning the basics of Adobe Workfront from intake and planning through execution and reporting. The course covers an introduction and overview of key components and best practices, while offering links to supplementary references, resources, and user materials, ensuring you have the necessary guidance to tackle the Certified Workfront Project Manager Professional exam and excel in your Adobe Workfront journey.",
        "modules": "Introduction, Basic Work Management, Custom Forms | Request Queues | Boards, Reporting | Project Finances, Course Conclusion"
    },
    "Adobe Workfront Core Developer  Professional": {
        "type": "course",
        "category": "Adobe Workfront",
        "level": "Professional",
        "job_role": "Developer",
        "objectives": "This learning program is specifically designed to provide new and beginning users with a fast start in learning the basics of Adobe Workfront. The course covers an introduction and overview of key components, configuration considerations, and best practices to provide you with the essential knowledge and skills required to setup a successful Workfront implementation. Additionally, the course offers links to supplementary references, resources, and user materials, ensuring you have the necessary guidance to tackle the Certified Workfront Core Developer Professional exam and excel in your Adobe Workfront journey.",
        "modules": "Course Introduction, Basic Work Management, System Setup & User Experience, Reporting | Finances| Integrations, Proofing | Resource Management, Course Conclusion"
    },
    "Adobe Experience Manager Foundations": {
        "type": "course",
        "category": "Adobe Experience Manager",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course is an introduction to Adobe Experience Manager (AEM). Learners will be introduced to key concepts, solutions, product features, and use cases related to the AEM ecosystem. This course will help you prepare for professional-level certifications in AEM.",
        "modules": "Introduction, Introduction to AEM as a CMS, Overview of AEM Solutions, Conclusion"
    },
    "Adobe Workfront Foundations": {
        "type": "course",
        "category": "Adobe Workfront",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course is an introduction to Adobe Workfront. Learners will be introduced to the product, key product features and use cases. Additional reference information and certification resources are also provided.",
        "modules": "Introduction, Product Introduction, Product Features, Conclusion"
    },
    "Adobe Marketo Engage Foundations": {
        "type": "course",
        "category": "Adobe Marketo Engage",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "In this course, you will explore the breadth of the Adobe Marketo Engage platform and how it helps B2B brands scale personalized engagement and grow a predictable pipeline of demand and revenue by attracting the right buyers, nurturing them across channels and journey stages, prioritizing demand and insights for sales and measuring the impact on revenue.",
        "modules": "Introduction, Adobe Marketo Engage, User Interface (UI), Profiles & Audiences, Omnichannel Engagement, Campaign Operations & Workflows, Additional Features, Conclusion & Quiz"
    },
    "Adobe Analytics Foundations": {
        "type": "course",
        "category": "Adobe Analytics",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course is an introduction to Adobe Analytics. You will learn the basics of digital analytics, how Analysis Workspace can be used for analysis and data visualization, typical use cases and product features. Additional reference information and certification resources are also provided.",
        "modules": "Course Introduction, Introduction to Adobe Analytics, Introduction to Analysis Workspace, Reviewing Product Features, Course Conclusion"
    },
    "Adobe Experience Cloud Essentials": {
        "type": "course",
        "category": "Adobe Experience Cloud",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "The Adobe Experience Cloud is what powers the backbone of the Adobe suite of the digital marketing tools. Understanding how it works will help you better manage and make strategic decisions around how you setup and deploy your marketing teams for success. Security and Privacy - How Adobe deploys, secures and provides mechanisms for companies to honor and enforce customer privacy Experience Cloud ID (ECID) - An overview of what the ECID is, why it matters and how its used to help power digital experiences across web and mobile User Access Control - How companies can administrate and manage their licenses within any of the Adobe Cloud product offerings",
        "modules": "Adobe Experience Cloud Essentials"
    },
    "The Evolution of the Experience Cloud": {
        "type": "course",
        "category": "Adobe Experience Cloud",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "In this module you will understand the evolution of the Adobe Experience Cloud and what lead to the creation of the Experience Platform. You'll also understand the unique challenges faced by marketing and engineering teams and the business that a centralized marketing brain provides to both organizations and customers. Describe the history behind the Adobe Experience Platform Describe why the Adobe Experience Platform was built and what problems it solves for both IT & marketing teams Be able to compare legacy and modern system approaches to marketing and customer management Describe the business value in building a single connection between IT systems and a centralized marketing brain to drive 1:1 personalized conversations across any channel at any time",
        "modules": "The Evolution of the Experience Cloud"
    },
    "Real-TimeCustomer Profile Essentials": {
        "type": "course",
        "category": "Adobe Experience Platform",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "Welcome to the Real -Time Customer Profile Essentials module. In this module, you will be introduced to the key components that power many of the applications that sit on top of the Adobe Experience Platform. You will learn about Real-Time Customer Profile's composition and architecture that empower marketing teams to deliver personalized conversations in an omni-channel world. The Adobe Real-Time Customer Profile brings together both pseudonymous and known customer data to create a singular view of a customer for marketing purposes. This service is the heart-beat of the Experience Platform and the applications built around it. Articulate the benefits of having a Real-Time Customer Profile Identify the key structural components for how the Real-Time Customer Profile is built Describe how the Real-Time Customer Profile is assembled Explain the different Segmentation types and Audience Evaluation methods within the Real-Time Customer Profile",
        "modules": "Real-Time Customer Profile Essentials"
    },
    "Experience Data Model (XDM) Concepts": {
        "type": "course",
        "category": "Adobe Experience Cloud",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "Welcome to the Experience Data Model (XDM) module. XDM is the foundational framework that allows Adobe Experience Cloud - powered by Adobe Experience Platform - to deliver the right message to the right person, on the right channel, at exactly the right moment. The methodology on which Adobe Experience Platform is built, XDM System, operationalizes Experience Data Model schemas for use by Platform services. In this module, you will see how XDM and the XDM system accelerate digital experiences within Adobe Experience Cloud applications and third-party platforms, and gain hands-on experience to model your own data. Outline the benefits and value of XDM for Adobe Experience Platform Define the essential building blocks used to construct an XDM schema Describe the various types of XDM descriptors and their purpose Define the various ways to manage schema evolution and best practices for schema building",
        "modules": "Experience Data Model (XDM) Concepts"
    },
    "Understanding Identity Service": {
        "type": "course",
        "category": "Adobe Experience Cloud",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "Welcome to the Understanding Identity Service module. Identity Service is a key component in Adobe Experience Platform and Real-Time Customer Profile. Understanding how it works, how to use it and why it operates the way it does is critical to being successful within Adobe Experience Platform. Describe the purpose and intent of the Identity Service within Adobe Experience Platform and the Real-Time Customer Profile Describe what an identity is composed of and what identity types are used to create identity graphs Manage identity links (i.e. relationships) within the identity graph from both a creation and deletion standpoint",
        "modules": "Understanding Identity Service"
    },
    "Adobe Mix Modeler Foundations": {
        "type": "course",
        "category": "Adobe Mix Modeler",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course introduces Adobe Mix Modeler and its key capabilities and features. You will learn how Adobe Mix Modeler is designed to help marketers understand and optimize their marketing investments.",
        "modules": "Introduction, Introducing Adobe Mix Modeler, Understanding Capabilities and Features, Conclusion"
    },
    "Adobe Target Foundations": {
        "type": "course",
        "category": "Adobe Target",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course introduces Adobe Target and its key capabilities and features. You will learn how Adobe Target empowers our customers to tailor and personalize their customer experiences.",
        "modules": "Introduction, Introducing Adobe Target, Understanding Capabilities and Features, Conclusion"
    },
    "XDM & the Real-Time Customer Profile": {
        "type": "course",
        "category": "Adobe Experience Platform",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "Welcome to the XDM & the Real-Time Customer Profile module. In this module, you will learn about how XDM plays an integral part in the construction of the Real-Time Customer Profile. Having a solid understanding of both will ensure you are successful with unlocking the full potential of Adobe Experience Platform. Define the difference between the Real-Time Customer Profile's primary entity vs. dimensional entity classes Describe what is required of each class when wanting to be used within the Real-Time Customer Profile Explain the various ways an identity can be modeled in XDM so that the Real-Time Customer Profile can leverage it Describe how to create relationships between primary entity schemas and XDM ad-hoc schema classes Describe the process to enable a schema for profile as well as the prerequisites and constraints after doing so",
        "modules": "XDM & the Real-Time Customer Profile"
    },
    "Adobe Customer Journey Analytics Foundations": {
        "type": "course",
        "category": "Adobe Customer Journey Analytics",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "Adobe Customer Journey Analytics, part of Adobe Experience Platform, enables real-time analysis and visualization of customer data from multiple channels. It combines online and offline data for a comprehensive view, offering cross-channel analysis, real-time processing, and AI-driven insights to optimize customer experiences and support data-driven decisions.",
        "modules": "Introduction, Introduction to Adobe Customer Journey Analytics, Introduction to Analysis Workspace, Understanding the Key Features, Conclusion"
    },
    "Adobe Commerce for Developers - Professional": {
        "type": "course",
        "category": "Adobe Commerce",
        "level": "Professional",
        "job_role": "Developer",
        "objectives": "Elevate your Adobe Commerce development skills with our comprehensive Adobe Commerce Developer Course, now updated to include the latest advancements in extensibility, microservices, and developer experience. This course is designed for both novice and experienced developers looking to deepen their expertise and stay ahead in the ever-evolving e-commerce landscape.",
        "modules": "1. Getting Started, 2. Installation, 3. Administration, 4. Developing, 5. Architecture, 6. Catalog, 7. SaaS Services, 8. Customers, 9. Sales, 10. Checkout, 11. CMS Content, 12. Cloud, 13. Extensions, 14. APIs, 15. Quiz, 16. Closing"
    },
    "Adobe Experience Manager Sites for Developers - Professional": {
        "type": "course",
        "category": "Adobe Experience Manager",
        "level": "Professional",
        "job_role": "Developer",
        "objectives": "Adobe Experience Manager Sites is the industry-leading content management system that empowers any marketer or developer to create high-performance pages across any digital property — from web to mobile to apps. ",
        "modules": "1. Adobe Experience Manager Sites for Developers - Professional, 2. Labs"
    },
    "Adobe Journey Optimizer for Business Practitioners  Professional": {
        "type": "course",
        "category": "Adobe Journey Optimizer",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "objectives": "This course is an introduction to Adobe Journey Optimizer. Learners will explore elevating customer engagement initiatives, fostering meaningful interactions, and becoming proficient in Adobe Journey Optimizer. This course will help you prepare for the Adobe Journey Optimizer Professional exam. Please note that each module is separate. The system will track your progression through the course. Still, you must select each separate module, complete it, and then move to the next module. Once all the modules in this course are completed, you will earn your course completion certificate.",
        "modules": "Introduction, 1. Getting Started, 2. Designing Journeys, 3. Testing and Simulations, 4. Optimization and Performance Monitoring, 5. Advanced Concepts, 6. Administrative Tasks"
    },
    "Adobe Journey Optimizer Foundations": {
        "type": "course",
        "category": "Adobe Journey Optimizer",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "At the conclusion of this course, you will be able to:​ Discuss the importance of customer journey management​ Recognize the Adobe Journey Optimizer workspace​ Outline the process for email campaigns using Adobe Journey Optimizer​ Explain how brands use data in their campaigns",
        "modules": "01. Introduction, 02. Introduction to Customer Journey Management, 03. Architecture Overview, 04. Using​ Adobe Journey Optimizer​, 05. Demonstrating How Customer Journeys are Built, 06. Course Conclusion, 07. Hands-on Exercise"
    },
    "Adobe Journey Optimizer for Developers  Expert": {
        "type": "course",
        "category": "Adobe Journey Optimizer",
        "level": "Expert",
        "job_role": "Developer",
        "objectives": "After completing this course you will be able to: Differentiate between batch, streaming and edge segments to optimize data handling strategies Implement A/B testing features to refine and enhance marketing campaigns effectively Utilize contextual attributes for impactful content manipulation and validate messages proficiently Implement personalized actions and comprehend the nuances of Journey Optimizer specific APIs Implement custom action tracking capabilities Attain proficiency in querying Journey Optimizer specific datasets and debug journeys effectively Manage user permissions, configure channels, and track parameters for effective UTM tracking",
        "modules": "01. Course Introduction, 02. Segment Building, 03. Web Channel, 04. Personalization and Content Management, 05. Custom Actions, 06. Event Setup and Governance, 07. Advanced Data Querying, 08. User Access Control and Channel Configuration, 09. Optimizing Batch and Streaming Use Cases, 10. Final Assesment"
    },
    "Adobe Commerce Foundations": {
        "type": "course",
        "category": "Adobe Commerce",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course provides foundational training covering essential product basics, program functionality, critical use cases, and real-world testimonials. Whether you're new to e-commerce or an experienced user, this course supplies you with the knowledge and insights needed to understand the dynamic world of Adobe Commerce. Just so you know, each module is separate. The system will track your progression through the course. Still, you must select each separate module, complete it, and then move to the next module. Once all the modules in this course are completed, you will earn your course completion certificate.",
        "modules": "01. Adobe Commerce Foundations: Course Overview, 02. Introducing Adobe Commerce, 03. Understanding Adobe Commerce Capabilities, 04. Understanding Adobe App Builder, 05. Understanding the Pre-built Business Functionality of Adobe Commerce, 06. Maximizing Commerce Site Value, 07. Final Quiz, Closing and Resources"
    },
    "Adobe Experience Platform Foundations": {
        "type": "course",
        "category": "Adobe Experience Cloud",
        "level": "Foundations",
        "job_role": "Non",
        "objectives": "In this course, learners will be introduced to Adobe Experience Cloud, an end-to-end suite of digital marketing tools built on the only platform designed for personalization at scale. Question about this course? Visit the community forum.",
        "modules": "Introduction, Introducing Adobe Experience Cloud, The Evolution of the Experience Cloud, Introducing Adobe Experience Platform, Conclusion"
    },
    "Firefly Custom Models and Services Foundations": {
        "type": "course",
        "category": "Adobe Firefly",
        "level": "Foundations",
        "job_role": "All",
        "objectives": "This course is an introduction to Adobe Firefly, Firefly Custom Models and Firefly Services. Learners will be given a quick overview of Adobe Firefly, learn about Firefly Custom Models and learn about Firefly Services including the Firefly APIs and SDK.",
        "modules": "Course Introduction, Overview of Adobe Firefly, Introduction to Custom Models, Introduction to Firefly Services, Course Conclusion"
    },
    "Adobe Real-Time Customer Data Platform Developer Expert": {
        "type": "certificate",
        "category": "Adobe Real-Time Customer Data Platform",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have:, Understanding of segment evaluation differences (stream, batch, edge), Understanding of use cases for APIs (how to build a developer project, how auth works), Understanding of identity service, Understanding of dataflow, Understanding of Adobe I/O, Understanding of how relationships work, Ability to build a data model (Schema, Identity, Relationships) for Customer use case, Ability to strategize to Merge the data based on Merge Policy, Understanding of how to determine the correct way of Data Labeling, Policy Enforcement and Privacy Services, Familiarity with data ingestion pattern limits, Understanding destinations and which to use, Understanding of the edge data collection framework, Ability to determine which AEP Permissions need to be configured (that is, attribute level permissions) (make recommendations to clients), Basic understanding of query service use cases, Basic understanding of sources/destinations SDK, You should be familiar with these concepts:, Entity relational diagrams, Admin/permissions, Experience platform APIs, Adobe Experience Platform Debugger, Web and mobile SDKs, You should be comfortable in these environments:, AEP, Edge network",
        "study_materials": "Section 1: Data Architecture (19%): Based on a scenario, translate RDBMS to Adobe RT-CDPs NoSQL data model, Demonstrate best practices for modeling the Real-Time Customer Profile, Design the identity strategy and relationships for modeling, ; Section 2: Real-Time Customer Profile (15%): Describe how profile assembly works, Describe how the Identity Graph works, Describe Profile Composition, Differentiate between edge vs. hub profile, ; Section 3: Data Ingestion (13%): Describe data ingestion capabilities with the CDP, Describe the capabilities of Edge ingestion, Describe the advanced techniques around data ingestion architecture, ; Section 4: Segmentation (18%): Describe different ways to build audiences & segments within the CDP, Explain the various segmentation types and how they operate, Demonstrate an understanding of how to apply use cases to segment/audience activation, ; Section 5: Activation (12%): Explain different activation patterns within CDP, Explain the guardrails around activation, Describe on site personalization, ; Section 6: Governance (9%): Apply best practices for governance in the Adobe RT-CDP implementation, Describe how to manage data across the various services, ; Section 7: Administration (15%): Understand monitoring capabilities, Describe alerts, Describe the different license usage, Describe use cases for ABAC enablement within Adobe RT-CDP, ",
        "details": "EXAM ID:AD0-E605; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:45/68; TIME LIMIT:2 hours 16 mins"
    },
    "Adobe Marketo Engage Architect Master": {
        "type": "certificate",
        "category": "Adobe Marketo Engage",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have:, A current certification as an Marketo Engage Business Practitioner Certified Expert, At least five years of experience, preferably with multiple instances of Marketo Engage, An understanding of the business impact and effectively explain/communicate their solution to the stakeholders (technical and non-technical) at different levels, The ability to conceptualize a solution and translate to a Marketo Engage architecture, understand the business processes impacted by integrations, Familiarity with the principles of architecting an instance, Additionally, you should be familiar with the following tools and technologies: Adobe Marketo Engage features, functionality, and appsDatabase systemsAPI connectivityCRM platformMarketing technology platforms",
        "study_materials": "Section 1: Project Leadership (16%): Given a case study, identify the right stakeholders, Evaluate a set of requirements and recommend project boundaries, budget, resources, and scope, Given a modified process, determine who needs enablement and efficient enablement rollout plan, Evaluate an audit and recommend priorities and timeline, ; Section 2: Marketo Engage Architecture Design (48%): Gather requirements/needs and recommend a lead management and lifecycle design, Review an existing implementation and provide findings, Given a business need, identify the different behaviors for scoring, Review an existing implementation, recommend actions to scale campaign execution, Outline an operational procedure for lead routing multiple countries, Given a scenario, evaluate the impact and requirements to incorporate new technology to the instance, Identify the different types of integrations and when to use them, Given a scenario, outline various stages in the person lifecycle impacted by proposed changes/requirements, Appraise a set of requirements and recommend an approach to campaign logic, ; Section 3: Reporting and Attribution (20%): Given a model to review, explain the concept of detours in the lifecycle modeler, Given an online advertising or organic social or content, recommend an approach for reporting, Illustrate how to validate Marketo Engage reporting in tracking lifecycle changes, Identify metrics to use in a given report type, Identify how to track multi-channel attribution to evaluate ROI, Identify and describe the pros and cons of different attribution models, Given a business requirement, describe the effects of channel set up to reporting, ; Section 4: Advanced Operations (16%): Given a scenario, identify appropriate steps to improve management or governance, Given a set of requirements, recommend an efficient data schema, Evaluate a customers implementation and recommend actions to improve deliverability, Evaluate a customers implementation and recommend actions to improve administration management, Gather information about a clients implementation and recommend security practices, Explain the applicability of workspace and partitions for a given scenario, ",
        "details": "EXAM ID:AD0-E560; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Commerce",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have a minimum of 0-12 months hands-on experience with Magento Open Source version 2.4.3 using the LUMA or BLANK theme and basic understanding of Adobe Commerce version 2.4.3., Additionally, you should have a basic understanding of the eCommerce experience, as well as familiarity with the following concepts:, Digital marketing (SEO, CMS, email marketing, sales techniques [cross-sell, upsell], analytics, reporting, and monitoring), Ecommerce terminology (sales/marketing strategies like omnichannel and multichannel), Pricing and promotion, Customer purchase journey, Order life cycle, Magento Marketplace and third-party extensions, Security and compliance (GDPR, ADA, PCI DSS v3.2.1, PSD2), Pricing and promotion",
        "study_materials": "Section 1: Magento Open Source core features (49%): Identify the features of Magento Open Source, Distinguish the correct scope and when to use each, Demonstrate knowledge of Catalog Management, Manipulate pricing by using Magento Open Source features, Describe the standard customer journey, Describe the standard order lifecycle, Describe the day-to-day tasks involved in Store maintenance, Explain the different types of content elements and when to use, ; Section 2: Adobe Commerce basics (14%): Identify the key features available in Adobe Commerce, Identify service Add-ons in Adobe Commerce, Identify hosting options for Adobe Commerce, ; Section 3: Digital marketing and eCommerce fundamentals (24%): Identify the basic uses of Digital Marketing tools (Google Analytics/Adobe Analytics, Google Tag Manager, Email marketing, Segmentation, Social plugins), Explain the basic principles of SEO, Identify the basic uses of common eCommerce tools (such as shopping feeds), Identify the key features of an eCommerce website, Identify the basic eCommerce concepts (including storefront options), ; Section 4: Compliance/security basics (13%): Understand the basics of compliance for privacy laws and payment security, Identify common security aspects of an Adobe Commerce project, Identify best practices and legal requirements of accessibility compliance, ",
        "details": "EXAM ID:AD0-E712; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Workfront for Experience Manager Enhanced Connector Expert": {
        "type": "certificate",
        "category": "Adobe Workfront for Experience Manager Enhanced",
        "level": "Expert",
        "job_role": "Connector",
        "prereq": "You should have achieved one or more of the following certifications:, AEM Assets Developer Certified Expert, AEM Sites Developer Certified Expert, Workfront Core Developer Certified Expert, And, you should have:, 1+ years CMS experience, 1+ years AEM experience, 1+ years Workfront experience, 2+ years Java/J2EE developer experience, Co-architected at least one AEM based solution, Experience working directly with clients to create customized solutions, An understanding of taxonomies and AEM tagging, AEM workflows, JCR, Sling, OSGi and databases, An understanding of work management best practices",
        "study_materials": "Section 1: Technical requirements (25%): Use Workfront Custom Forms, Given a scenario, demonstrate document management, Demonstrate knowledge of promoting code across environments, Given a scenario, identify how values are passed to Workfront custom forms, Troubleshoot server-side code, ; Section 2: Configuration (26%): Illustrate best practices for user management, Apply procedural concepts required to modify existing AEM asset workflows, Make decisions required to customize metadata schema for different asset types, Apply procedural AEM concepts required to deploy OSGi bundles, assets, metadata schema, tagging, and permissions, ; Section 3: Business practices (21%): Interpret client needs in order to recommend the appropriate workflow strategies, Demonstrate how to set up Workfront approval and proofing workflows, Given a scenario, identify best practices for using the proofing viewer, settings, and markup functionality, Demonstrate an understanding of tracking deliverables as part of campaign management, Given a scenario, identify the key considerations of change management for a Workfront implementation, ; Section 4: Installation and configuration of connector (28%): Validate prerequisites within AEM, Given a customer use case, identify the features of the connector to implement, ",
        "details": "EXAM ID:AD0-E906; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:34/55; TIME LIMIT:1 hour 50 mins"
    },
    "Adobe Analytics Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Analytics",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have a minimum of 3 months of experience in Adobe Analytics and the following experience:, A marketing background or come from a marketing role but can come from a variety of job roles., A basic familiarity with digital analytics metrics and dimensions., The ability to use Analytics to build reports and answer business questions, and communicate the results., An understanding of basic digital analytics concepts like segmentation, report building, standard metric definitions.",
        "study_materials": "Section 1: Business analysis (34%): Given a business need/question, identify an appropriate reporting strategy to perform an analysis, Analyze data to answer business questions, Identify conversion funnels (as a concept to understand business analysis), Consult the Solution Design Reference (SDR) to determine what data is available in reports, Analyze report data to summarize and draw conclusions, Recognize outliers and anomalies in reports, ; : Given a business need/question, identify an appropriate reporting strategy to perform an analysis, Analyze data to answer business questions, Identify conversion funnels (as a concept to understand business analysis), Consult the Solution Design Reference (SDR) to determine what data is available in reports, Analyze report data to summarize and draw conclusions, Recognize outliers and anomalies in reports, ; Section 2: Reporting and dashboarding for projects (38%): Consider the advantages of using specific visualizations based on a given scenario, Compare fallout and flow visualization, Apply the process to schedule and share Projects for different users and/or groups, Apply the process to look up and combine dimensions, metrics, date ranges, and segments, Apply the process to create a visualization, Given a scenario, determine the appropriate item to use, Report on marketing campaign performance, ; Section 3: Segmentation and calculated metrics (19%): Determine how to develop and configure basic segments using best practices, Apply the process to share segments with others in the organization, Apply segments to Projects and Components, Apply the process to generate basic calculated and/or segmented metrics, ; Section 4: General tool knowledge and troubleshooting (9%): Understand different types of dimensions and parameters existing in Adobe Analytics (evars, props, and events), Determine how to export data from Adobe Analytics, ",
        "details": "EXAM ID:AD0-E212; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Sites Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Experience Manager Sites",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, Experience with AEM features and capabilities needed to engage developers to find business solutions, The ability to use AEM products to manage content to drive digital experiences, An understanding of what modules are present, A deeper insight into modules such as Sites, Assets, and Forms, Additionally, you should be familiar with the following technologies and environments:, Content management tools, Digital asset management tools, Projects, Forms, Experience fragments and content fragments, Screens, Workflows, Launches, CRXDE Lite, User administration, Multi-site management, Monitoring tools, Versioning, Personalization and context hub, SPA Editor, Tagging, Browser usage, General understanding of the Web, Responsive web design concepts",
        "study_materials": "Section 1: Education (22%): List relevant AEM features and capabilities, Recommend how to leverage AEM features to meet business needs, Apply procedural concepts necessary to conduct training for content editors, ; Section 2: Architecture (24%): Recommend an Information Architecture to leverage AEM Standard Features to meet business needs using on-prem or Adobe hosted (Cloud) environment, Describe how AEM integrates with third-party services, Determine how to define roles and permissions, Describe caching approaches, ; Section 3: Business Analysis (38%): Map standard modules of AEM to different business problems for the customer, Apply content management concepts for AEM modules, Identify typical project stakeholders, Apply procedural concepts necessary to support collaboration of all parties involved, Determine how to meet the core business goals while remaining within budget and/or scope, Determine how questions from developers should be answered with respect to the business goals, ; Section 4: Setup and Implementation (16%): Determine how to configure and use content components to show best practices of AEM, Verify the correct implementation of features, and locate and describe occurring errors, ",
        "details": "EXAM ID:AD0-E121; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Analytics Architect Master": {
        "type": "certificate",
        "category": "Adobe Analytics",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have a minimum 3-4 years of experience designing Adobe Analytics architecture, data layer specifications, and tag management, as well as a basic understanding of JavaScript code., Additionally, youre responsible for translating business requirements into tracking specifications and Adobe Analytics variables, and youre familiar with the following technologies and environments:, Web Analytics Applications, Adobe Experience Cloud, Tag Management Systems, CMS, Browser developer tools, Optimization tools, Code editors",
        "study_materials": "Section 1: Discovery (18%): Demonstrate ability to audit sites, Investigate client needs to build business requirements, Given a scenario, create a measurement framework, ; Section 2: Solution design (54%): Translate business requirements into variables and metrics, Demonstrate ability to manage report suites settings, Given a scenario, recommend the best methods for collecting data, Write technical specifications for tagging engineers, Write technical specifications for site developers, Create Experience Cloud users/groups, ; Section 3: Post implementation (28%): Given a set of requirements, validate tracking through browser developer tools and Adobe reports, Apply procedural concepts to manage data extraction and relationships, Evaluate data privacy requirements to establish a data governance model, Given a scenario, manage data sources and connectors, Configure necessary segments and calculated metrics to answer business requirements, ",
        "details": "EXAM ID:AD0-E207; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Cloud Service Migration Expert": {
        "type": "certificate",
        "category": "Adobe Experience Manager Cloud Service",
        "level": "Expert",
        "job_role": "Migration",
        "prereq": "You should have:, An understanding of the overall changes to the architecture and features when moving from any AEM service (self-managed, AMS or any third-party cloud) to AEM as a Cloud Service., 1-3 years of web application development experience using Adobe Experience Manager, Hands on experience using AEM Forms, Assets, and Sites, The ability to guide customers through the migration process, advising and participating in all phases of an AEM project, Additionally, you should be familiar with the following technologies and environments:, Index conversion tools, Workflow conversion tools, Dispatcher tools, Content delivery network (CDN), Best Practices Analyzer, AEM Modernization, Repository Browser, Developer Console, User mapping tool for IMS Adobe, I/O cmd tool, New Relic, Local Cloud SDK, Development, Stage, Prod Author, Publish and Preview Service, Local Dispatcher setup using Docker, Tailing Cloud logs in local environment, Cloud console interfaces",
        "study_materials": "Section 1: Assessment (32%): Use the BPA, Prepare and estimate a migration plan, Assess which user, groups and permission need to be moved, Review deprecated capabilities, Determine the workflow requirements, Explain the requirements for content transfer, Explain asset related implementation and its impact, Identify Dispatcher related requirements, ; Section 2: Design (16%): Review existing components and validate with the latest version, Prepare configuration for assets microservices, Explain caching strategy, ; Section 3: Deployment (16%): Configure Cloud Manager pipelines and tie to the environments, Provision AEMaaCS environments (dev, stage, prod - author, publish, preview), Manage the deployment process with the help of Adobe IO CLI, ; Section 4: Migration (20%): Execute tests, Prepare an asset migration strategy, Prepare an initial/base content migration strategy, Execute migration tools (content transfer, modernizing, refactoring). Report & refine outcomes, especially critical outcomes not handled by tooling, Plan the post go-live support, ; Section 5: Implementation (16%): Merge multiple projects into a single project to be deployed through Adobe pipeline, Manage repointit scripts for user/group permission, Set up local SDKs, Update configurations based on runmodes available on AEM as a Cloud Service, ",
        "details": "EXAM ID:AD0-E136; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Marketo Engage Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Marketo Engage",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, Approximately 6 months hands-on experience, The ability to understand the marketing needs expressed by task requirements in order to apply a technical solution, The ability to build a simple program from beginning to end, The ability to create a Smart List and Smart Campaign, Knowledge of how to create segmentations, An understanding of Data review (cleanup), An understanding of Database (how to create people, Activity Log, unsubscribe, blocklist, email invalid concepts), The Ability to understand the importance of privacy regulations, Understanding of Email marketing, Additionally, you should be familiar with the following tools and technologies:, Adobe Marketo Engage, Excel or Google Sheets/Doc",
        "study_materials": "Section 1: Building and managing programs (39%): Identify when to use each of the 4 program types., Identify why/when to use the event program., Identify why/when to use the default program., Identify the special features of engagement program., Identify the special features of email program., Recognize what can be cloned., Identify the benefits of custom tags., Identify the purpose of channels., Describe the importance of Period Costs., Recognize the concept of using lead scoring., Understanding Communication limits., Recognizing program membership and acquisition., Understanding customer preferences (subscription, communication)., Apply best practices for review prior to launch., ; Section 2: Building assets (19%): Manipulating files in Design Studio (uploading/replacing images and files)., Create/Modify a form using the Form Editor., Create/Edit an email using the Email Editor., Create/Edit a landing page using the Landing Page Editor., Create/Edit a Snippet in the Snippet Editor., Distinguish the difference between draft and approved assets., Distinguish the difference between local and global assets., ; Section 3: Defining and targeting audiences (33%): Create/Modify Smart Lists., Understand Smart Campaign flow steps., Understand how to schedule and/or activate Smart Campaigns., Interpret Smart Campaign results., Describe the purpose of a segmentation and its use., Identify and navigate the Database., Explain how to set privacy settings in Adobe Marketo Engage., Differentiate between Smart Lists and Static Lists., Define system Smart Lists., Compare and contrast the different types of Smart Campaigns., Understand how Smart Campaign triggers and filters work., Differentiate the different list imports., ; Section 4: Analyzing and building reports (9%): Explain the standard Adobe Marketo Engage reports and when they should be used (Email Link Performance, Email Performance, Landing Page Performance, People Performance, Program Performance, Web Page Activity, and so on), Comprehend Dashboard information and metrics (Email Program Dashboard, Engagement Program Dashboard), Comprehend Email Insights metrics, ",
        "details": "EXAM ID:AD0-E555; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:36/55; TIME LIMIT:1 hour 50 mins"
    },
    "Adobe Document Cloud Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Document Cloud",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "At least 0-12 months of experience within Adobe Document Cloud, Be able to identify and communicate business needs, Be able to perform product enablement advice on Adobe Document Cloud solutions.",
        "study_materials": "Section 1: Use Case Discovery (36%): Ask qualifying questions to identify Document Cloud opportunities, Define high level business use cases, ; Section 2: Business Process Evaluation (34%): Identify key areas of process improvement and solution fit, Align business goals with Document Cloud capabilities, Provide high level end user focused demonstrations of different components of Document Cloud, ; Section 3: Define Document Cloud (DC) Capabilities (18%): Outline the implications of compliance and security needs of Document and E-signature, Describe how process change adds value, ; Section 4: Recommend Solution (12%): Recommend Document Cloud solution design, ",
        "details": "EXAM ID:AD0-D106; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:34/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Forms Backend Developer Professional": {
        "type": "certificate",
        "category": "Adobe Experience Manager Forms Backend",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should be a backend forms developer and have:, 0-12 months of experience working with the AEM Platform, 12 months experience using and configuring Adobe Cloud Manager, At least 24 months experience configuring, implementing, and managing Continuous Integration/Continuous Deployment tasks, Additionally, you should be comfortable working in Adobe Managed Services and Adobe Experience Manager as a Cloud Service. Are able to set up Adobe Experience Manager environments and infrastructure., You should be familiar with the following technologies and environments:, Cloud Manager, Adobe IO CLI, Git CLI, Cloud transition tools, Dispatcher converter, Repository modernizer, Dev staging and production, Dev sandbox, Local environment",
        "study_materials": "Section 1: Forms creation and management (26%): Given a scenario, identify steps needed to build AEM Forms, Describe Forms Data Model, Identify steps to customize AEM Forms, Given a scenario, identify steps to use JavaScript ClientLib leveraging GuideBridge API, ; Section 2: Processes and workflows (34%): Given a scenario, identify the steps for a Form approval workflow, Identify features of an OSGi bundle using Document Services API, Given a scenario, schedule different asynchronous batch processes using Watchfolder endpoint, Identify different outputs from XFA/XDP design, Given a scenario, manipulate a PDF using Forms or Assembler services, Describe ways to implement JDBC services, ; Section 3: Administration and troubleshooting (21%): Identify issues generated in log files, Given a scenario, identify the steps to perform administration activities, Identify the features of Service Packs in AEM Forms, Describe the steps for AEM Dispatcher setup for Forms, Describe the steps to navigate different consoles, ; Section 4: API endpoints and integrations (10%): Given a scenario, describe the flow to integrate AEM Form with Adobe Experience Cloud, Identify the steps to generate various endpoint services, ; Section 5: Interactive communication (9%): Given a scenario, demonstrate and implement processes for Interactive Communication, ",
        "details": "EXAM ID:AD0-E127; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:29/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Sites Developer Expert": {
        "type": "certificate",
        "category": "Adobe Experience Manager Sites",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "The Minimally Qualified Candidate (MQC) is an application developer with a minimum of 12 months experience working with the AEM Platform. The candidate should be able to perform advanced component development, have a deep understanding of the Model View Controller (MVC) framework, be aware of frameworks and libraries in AEM. In addition, the MQC will have an understanding of the AEM development life cycle.",
        "study_materials": "Section 1: Configurations (24%): Given a scenario, identify which dispatcher rule to implement, Given a scenario, determine the steps to configure multi-tenancy, Given a scenario, determine the steps to configure OOTB SAML and LDAP integration, Determine the steps to set up replication agents, Given a scenario, identify the steps to configure editable templates or content fragment models, ; Section 2: AEM development (33%): Given a scenario, determine the steps to implement SPA structure, Sling Model Exporter, templates, and components, Given a requirement, identify the steps to create custom components including the HTL, models, and services, Given a scenario, determine the method to create unit tests and map mock data, Given a scenario, determine the approach to develop a third-party API integration, Given a scenario, determine the approach to implement OSGi services or servlet types, Given a scenario, select the appropriate JCR query, ; Section 3: Build and Deployment (25%): Identify the steps to set-up and maintain front-end and back-end dependency management, Given a scenario, identify the command to create a project using Maven archetype, Given a scenario, identify the steps to create a custom run mode configuration, Given a scenario, determine the steps to configure workflows, Given a scenario, determine the method to create and manage custom Oak indexes, ; Section 4: Environment Maintenance (18%): Given a scenario, determine the steps required to manage AEM environments configuration, Identify the process regarding AEM release management, Identify the steps use package manager to sync content/configurations across AEM environments, Given a scenario, identify which maintenance tool to use, ",
        "details": "EXAM ID:AD0-E137; LEVEL:Expert (1-3 years experience); COST:$225 (Global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Developer Expert (NEW)": {
        "type": "certificate",
        "category": "Adobe Commerce",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have at least 2 years hands-on experience with Adobe Commerce, strong programming skills, and some experience with App Builder. They should have the ability to translate the needs expressed by task requirements into a technical solution., This exam is based on (Adobe Commerce v2.4.7)., A candidate should have experience with and/or knowledge of:, Adobe Commerce, Adobe Commerce Coding Standards Technical Guidelines (https://developer.adobe.com/commerce/php/coding-standards/technical-guidelines/), relational databases, the basic functions of both a web browser and server and how they communicate with one another, performance optimization and analysis as it relates to software, general understanding of the build and delivery process for Adobe Commerce, the built-in features/functionality of the application that may allow solutions without additional development, basic knowledge of Front-end and (i.e., HTML, CSS, LESS, PHP, , XML, MySQL), working knowledge of Javascript, PHP, and Back-end Adobe Commerce technologies",
        "study_materials": "Section 1: Architecture (38%): Demonstrate how to effectively use cache in Adobe Commerce, Demonstrate knowledge of components (plugin, preference, observers etc.), Determine the effects and constraints of configuring multiple sites on a single instance, Explain the use cases for Git patches and the file level modifications in Composer, Explain Adobe Commerce security features (CSP, escaping, form keys, sanitization, reCAPTCHA, input validation), Explain how the CRON scheduling system works, Explain index functionality, ; Section 2: External Integrations (14%): Customize the data flow in and out of SaaS services, Utilize App Builder, Utilize Adobe I/O events and Webhooks, ; Section 3: Customizations (32%): Customize the catalog, Customize check out and sales operations, Manipulate entity types programmatically, Customize the admin panel, Customize APIs, Demonstrate the ability to leverage existing message queues and create new queues, Demonstrate how to write an integration test, ; Section 4: Cloud (16%): Explain Adobe Commerce Cloud architecture, Setup and configure Adobe Commerce Cloud, Utilize Adobe Commerce Cloud CLI tool, ",
        "details": "EXAM ID:AD0-E725; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe ColdFusion Certified Professional": {
        "type": "certificate",
        "category": "Adobe ColdFusion",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "",
        "study_materials": "Section 1: Database Operations (19%): Know basic CRUD operations, Know the basic syntax to perform CRUD operations, Know the difference between tag- and script-based CRUD operations, Correctly parameterize queries by using tags and scripts, Describe what ORM is, Create and use an ORM data object, Explain the basics of Query of Queries, Know when to use or not use query caching, ; Section 2: Development Fundamentals (16%): Use tags and script in ColdFusion, Explain the basics of ColdFusion applications, Use ColdFusions capabilities to support code reuse, scalability, and maintainability, Write secure ColdFusion code, Understand Ternary and null operator, ; Section 3: Variables and Scopes (18%): Work with lists, arrays, and structures, Identify methods for looping over data and when to use each methods, Understand proper use of scopes, Use CF Lock with shared scope variables, Understand member functions, Understand variable caching, ; Section 4: OOPs Concepts (26%): Understand components, Use design patterns, Add methods to a component, Understand Access Modifiers on methods and components (public and private), Understand proper use of property getters and set the values, Identify various types of constructors, Understand Inheritance, Understand Interfaces, ; Section 5: Document Manipulation (8%): Creating PDFs with, Understand HTML to PDF Conversion with, Manipulate PDF documents with Cfpdf, Understanding of different Document manipulation tags, such as spreadsheet, ; Section 6: Output and Presentation (13%): Understand proper use of cfoutput, Loop over result sets, Understand the basics of exception handling, Use custom tags for reusable output blocks, ",
        "details": "EXAM ID:AD0-P101; LEVEL:Professional (0-12 months experience); COST:$149 (global); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:41/62; TIME LIMIT:1 hour 30 mins"
    },
    "Adobe Real-Time CDP Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Real-Time CDP",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, Experience with one or more Real-Time CDP environments, Familiarity with digital marketing technology stacks and various platform integrations, An understanding of data flows (ID types,ID syncs, audiences, segments, data models), 6-12 months of experience creating and activating audiences using a CDP, Experience with tasks that include:, Building audiences in Real-Time CDP (segments) mapping those to destinations (activating them), Understanding and applying concepts of profile merge, how data stitching works in Real-Time CDP, Navigating the UI, Understanding policies (DULE) and applying them as applicable, Understanding concepts of Identity namespaces and Identity graphs, Understanding high level capability and features of AEP and its services, Configuring new destinations",
        "study_materials": "Section 1: Segments and activation (32%): Create segment and activate to destination, Configure new destinations, Apply concepts required to target identities in destinations, Identify attribute mappings and scheduling of segments to destination, ; Section 2: Privacy and data governance (20%): Demonstrate an understanding of DULE policies and their impacts on data availability at destinations, Ensure privacy and data compliance measures are followed, ; Section 3: Business analysis (30%): Identify use cases that tie back to business KPIs, Perform data analysis on customer segments in platform, Demonstrate an understanding of data flow concepts, ; Section 4: Schemas and profiles (18%): Demonstrate an understanding of Adobe Experience Platform concepts, Use profile features, ",
        "details": "EXAM ID:AD0-E602; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Target Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Target",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, 0-12 months experience with optimization platforms, including Adobe Target, Supervised hands-on experience with Adobe Target, 0-12 months experience leading/contributing to optimization programs, Ability to identify basic Target/Adobe Marketing Cloud administrative tasks (preferences, user roles and permissions, settings), A basic knowledge of the three-step workflow (experiences, targeting, and goals and settings, including all reporting sources), The ability to read and understand Activity reporting results",
        "study_materials": "Section 1: Planning and strategy (26%): Identify business KPIs, Given a scenario of business KPIs and data analysis, identify opportunities for optimization, Describe how variables impact an activity, Construct test hypotheses based on a given scenario, Identify hypotheses elements, Describe KPI-based primary and secondary success metrics, Given a scenario, assess audience requirements, Describe appropriate analytics reporting sources (that is, Target or Adobe Analytics), ; Section 2: Configuring, executing and managing (50%): Explain the use of Form-Based Experience Composer vs. the Visual Experience Composer, Describe procedures to create an experience using VEC, Describe procedures to create an experience using Form-Based Composer, Describe procedures to manage experiences within an experience composer, Describe the workflow that applies to creating Target Activities, Given a scenario, apply procedures to create an A/B test activity, Given a scenario, apply procedures to create an XT activity, Given a scenario, apply procedures to create an MVT activity, Identify how AP is used for solutions, Identify when to use the Recommendation activity, Describe procedures to create an Audience in Target, Describe procedures to set Goals and Settings, Describe procedures to conduct Activity QA, Describe procedures to manage Activities and Audiences within Target, ; Section 3: Analyzing and reporting (16%): Describe settings to help set the elements that appear in a report, Describe the difference in Adobe Target Sample Size Calculator settings between planning and validating, Describe common problems associated with A/B testing, Identify how Automated Personalization Summary reports differ from other reports, Describe the features of Experience Performance reports (MVT), Describe best practices that should be followed in A/B testing execution, ; Section 4: Troubleshooting (8%): Given a scenario, identify activity qualification issues, Identify the features of browser debugging tools (including Experience Cloud Debugger), Identify metrics and reporting, ",
        "details": "EXAM ID:AD0-E408; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Workfront Fusion Developer Professional": {
        "type": "certificate",
        "category": "Adobe Workfront Fusion",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should have:, The ability to with Workfront API and API explorer, but not necessarily proficient in API calls, The ability to use custom API calls for working with Workfront and other APIs, The ability to use modules for the Workfront app and other actions like create, read, update, delete, and search, The ability to build viable solutions that produce business outcomes without hitting Fusion guardrails, The ability to select appropriate trigger module to accomplish business outcomes, An understanding of how to use flow control (routes, iterators/aggregators, explain flow), The ability to conduct basic troubleshooting and error handling, The ability to effectively test and go live with a scenario, The ability to manage organization teams and users, An understanding of the purpose and use of universal connectors for REST API Oauth2",
        "study_materials": "Section 1: Foundational technical concepts (39%): Given a Fusion scenario with one field format that needs to be in another field format, provide the possible functions that could be used to transform the data correctly, Given a Fusion scenario that requires a function to be nested inside another function, select the properly formed expression Identify ways to use teams to control access to connections and other Fusion features Given a Fusion scenario, identify system and feature limitations Given a Fusion scenario that requires timezone manipulation, distinguish between the user, visible organization, and where overriding the timezone is needed Given a Fusion scenario, select the appropriate Workfront module(s) or action(s) Given a Fusion scenario, select the Mapping Panel expression and/or module(s) that would appropriately transform input data to output data Identify the correct way(s) to utilize the Fusion Dev Tool to troubleshoot errors in execution or determine calls and responses made to third-party systems Given a Fusion scenario where data in one path is needed in another path, provide a set-get solution for making that data available on additional routing paths Identify the ways to use or produce a Fusion template for a business need Given a Fusion scenario, identify what to do to view executions and/or resolve errors Identify the different options in the Fusion scenario settings to address scenario needs Given a Fusion scenario, select the appropriate flow control and/or determine the correct combination of flow control module(s), Identify ways to use teams to control access to connections and other Fusion features Given a Fusion scenario, identify system and feature limitations Given a Fusion scenario that requires timezone manipulation, distinguish between the user, visible organization, and where overriding the timezone is needed Given a Fusion scenario, select the appropriate Workfront module(s) or action(s) Given a Fusion scenario, select the Mapping Panel expression and/or module(s) that would appropriately transform input data to output data Identify the correct way(s) to utilize the Fusion Dev Tool to troubleshoot errors in execution or determine calls and responses made to third-party systems Given a Fusion scenario where data in one path is needed in another path, provide a set-get solution for making that data available on additional routing paths Identify the ways to use or produce a Fusion template for a business need Given a Fusion scenario, identify what to do to view executions and/or resolve errors Identify the different options in the Fusion scenario settings to address scenario needs Given a Fusion scenario, select the appropriate flow control and/or determine the correct combination of flow control module(s), Given a Fusion scenario, identify system and feature limitations Given a Fusion scenario that requires timezone manipulation, distinguish between the user, visible organization, and where overriding the timezone is needed Given a Fusion scenario, select the appropriate Workfront module(s) or action(s) Given a Fusion scenario, select the Mapping Panel expression and/or module(s) that would appropriately transform input data to output data Identify the correct way(s) to utilize the Fusion Dev Tool to troubleshoot errors in execution or determine calls and responses made to third-party systems Given a Fusion scenario where data in one path is needed in another path, provide a set-get solution for making that data available on additional routing paths Identify the ways to use or produce a Fusion template for a business need Given a Fusion scenario, identify what to do to view executions and/or resolve errors Identify the different options in the Fusion scenario settings to address scenario needs Given a Fusion scenario, select the appropriate flow control and/or determine the correct combination of flow control module(s), Given a Fusion scenario that requires timezone manipulation, distinguish between the user, visible organization, and where overriding the timezone is needed Given a Fusion scenario, select the appropriate Workfront module(s) or action(s) Given a Fusion scenario, select the Mapping Panel expression and/or module(s) that would appropriately transform input data to output data Identify the correct way(s) to utilize the Fusion Dev Tool to troubleshoot errors in execution or determine calls and responses made to third-party systems Given a Fusion scenario where data in one path is needed in another path, provide a set-get solution for making that data available on additional routing paths Identify the ways to use or produce a Fusion template for a business need Given a Fusion scenario, identify what to do to view executions and/or resolve errors Identify the different options in the Fusion scenario settings to address scenario needs Given a Fusion scenario, select the appropriate flow control and/or determine the correct combination of flow control module(s), Given a Fusion scenario, select the appropriate Workfront module(s) or action(s), Given a Fusion scenario, select the Mapping Panel expression and/or module(s) that would appropriately transform input data to output data, Identify the correct way(s) to utilize the Fusion Dev Tool to troubleshoot errors in execution or determine calls and responses made to third-party systems, Given a Fusion scenario where data in one path is needed in another path, provide a set-get solution for making that data available on additional routing paths, Identify the ways to use or produce a Fusion template for a business need, Given a Fusion scenario, identify what to do to view executions and/or resolve errors, Identify the different options in the Fusion scenario settings to address scenario needs, Given a Fusion scenario, select the appropriate flow control and/or determine the correct combination of flow control module(s), ; Section 2: Scenario design and architecture (35%): Given a list of steps, choose the correct sequence to parse JSON and convert to bundles, Given a set of requirements, identify the correct data look up method, Identify differences between instant and scheduled triggers, Identify a correct module for uploading a document to Workfront, Given a business requirement, identify the correct approach to track that Fusion processed a record (not a user) and when, Given a Fusion scenario, identify an opportunity to simplify the design and/or optimize for maintenance, Identify Fusion best practices for documenting scenarios, Given a situation, identify an opportunity to reduce data flow through a scenario, Given an example of the number of bundles shown on a search module and a following aggregator, explain the changes in the number of operations processed and displayed by the bundle inspector, Identify information that is found in the bundle inspector, Given a description of a need to archive a scenario for longer than 60 days and select the only possible way (import/export blueprint), Given an example of an Error 403: Forbidden, correctly select the origin of the error message and cause, ; Section 3: Testing and error handling (16%): Identify the elements of a test plan, Identify the elements of a test case, Given a Fusion scenario, correctly identify the appropriate directive to handle an unreliable service, Identify the process to add custom error handling in a Fusion scenario, Identify how to track, read, and resolve incomplete executionsGiven a Fusion scenario with missing required data, select ways to handle the invalid data, Given a Fusion scenario with missing required data, select ways to handle the invalid data, ; Section 4: Working with APIs (10%): Given a third-party API that returns a 429: Too Many Requests, identify a solution to prevent or handle the error, Given a Fusion scenario where new functionality is not available in the Workfront module, identify the correct reference and module type to use the new functionality, Given a third-party system that does not have a dedicated app, identify the HTTP app and select the appropriate module, Identify the difference between CRUD operations and other common capabilities of REST APIs, ",
        "details": "EXAM ID:AD0-E902; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/51; TIME LIMIT:1 hour 42 mins"
    },
    "Adobe Experience Manager Technical Foundations Professional": {
        "type": "certificate",
        "category": "Adobe Experience Manager Technical",
        "level": "Professional",
        "job_role": "Foundations",
        "prereq": "You should be an application developer and have:, A minimum of 0-12 months experience working with the AEM Platform, The ability to perform advanced component development, A deep understanding of the MVC framework, The awareness of frameworks and libraries in AEM, An understanding of the AEM development life cycle, Additionally, you should be familiar with the following technologies and environments:, Maven, Git, Development and packaging tools, Command line tools, JVM, Staging environments, Different AEM hosting capabilities, Sync content/environments together",
        "study_materials": "Section 1: Content creation (33%): Manage content pages, Replicate content, Configure policies, Use DAM to upload and publish assets, Use content fragments, Apply procedural concepts to use components, Apply procedural concepts to translate content, Use multi-sites and live copies, ; Section 2: Implementation (42%): Apply procedural concepts to create components, Create editable templates, Create client libraries, Update content in CRXDE Lite, Use JCR structure to navigate to nodes, Create experience and content fragments, Extend core components, Structure content modeling, ; Section 3: Setup and deployment (13%): Install bundles, Deploy packages, Install AEM instances, ; Section 4: Maintenance and user administration (12%): Manage user access, Modify OSGI configurations, Create queries, ",
        "details": "EXAM ID:AD0-E132; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:38/60; TIME LIMIT:2 hours"
    },
    "Adobe Workfront Core Developer Professional": {
        "type": "certificate",
        "category": "Adobe Workfront Core",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "While this exam does not require coding/programming knowledge, it does require at least 3 - 6 months of hands-on experience using Adobe Workfront., Qualified candidates should also have:, Experience with Adobe Workfront functionality and connectivity through intake, approval, planning, executing, and reporting, In-depth understanding of Adobe Workfront object types, including custom forms and approval workflows, templates, durations, work effort/planned hours, In-depth understanding of Adobe Workfront Setup, including access levels, layout templates, project preferences, and other methods to achieve simplicity of end-user design, Understanding of and experience with process mapping, Understanding of different Adobe Workfront personas and how to engage in support, Familiarity with native connectors and other Adobe Workfront products and services, Familiarity with project management including agile and waterfall, and resource management concepts",
        "study_materials": "Section 1: Strategy and Intake (23%): Use Portfolios and Programs, Use Request Queues, Use Custom Forms, Use Basic Approvals, ; Section 2: Budget and Planning (11%): Use the Resource Planner, Given a scenario/set of requirements, apply the configurations to set up a project template, ; Section 3: User Experience (25%): Illustrate best practices for user management in creating the right user experience, Given a scenario, apply the correct set up for sharing and access rights across the system, Describe what a Kickstart is and recognize when to use it, Demonstrate how to create and use timesheets, Describe the purpose and value of connectors, plug-ins, and add-ons, ; Section 4: Metrics and Reporting (16%): Describe basic concepts for building, sending, and customizing reports, Explain how to build and customize dashboards, Demonstrate how to configure functional views of reports, ; Section 5: Execution (24%): Demonstrate how to set up approval and proofing workflows, Recognize the purpose of creating an issue for a project, Demonstrate how to customize group-level project statuses, Identify the attributes needed to enable Agile in Workfront, Identify the ways to enter time in Workfront, Identify the elements of financial tracking in Workfront, ",
        "details": "EXAM ID:AD0-E908; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:45/70; TIME LIMIT:2 hours 20 mins"
    },
    "Adobe Campaign Standard Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Campaign Standard",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "You should have experience working in a channel delivery environment (email, direct mail, mobile, and social); familiarity with marketing campaign tactics such as multi-touch, life cycle, and reactivation; and an understanding of marketing metrics such as ROI, clickthrough rates, and conversion., Additionally, you should have:, Field experience working with Adobe Campaign Standard with regular frequency, An ability to process data files, An understanding of the concepts of relational databases, triggers, APIs, and technical workflows, An understanding of how to build marketing workflows and work with the underlying data to launch marketing workflows, Experience configuring reports, An understanding of campaign delivery set up and approvals",
        "study_materials": "Section 1: Delivery management (25%): Apply best practices in setting up and deploying a delivery, Determine the correct delivery configuration, Apply Email Designer functionalities to appropriate scenario, ; Section 2: Campaign management (25%): Apply configurations to execute workflows, Apply best practices in planning, outlining, and modifying a campaign, ; Section 3: Requirements analysis (10%): Design a new workflow based on business/campaign requirements, Interpret customer requirements, ; Section 4: Reporting (15%): Given customer requirements, determine the appropriate report to generate, Given a scenario, customize an out-of-the-box dynamic report, Given sample OOTB report data, provide an interpretation of the results, Apply the process to schedule and send an OOTB report, ; Section 5: Troubleshooting (10%): Monitor and identify errors, Analyze and interpret deployment results, ; Section 6: Data management and administration (15%): Explain data model resources, Perform Campaign Standard administration, Apply the process to build targeted audiences, ",
        "details": "EXAM ID:AD0-E307; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Audience Manager Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Audience Manager",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, 1-2 years of experience in the field of marketing technology, 3-6 months of experience with audience activation, Experience with Boolean logic, digital marketing jargon, data analytics and strategies, Knowledge of business objectives and KPIs, Familiarity with digital marketing technology stacks and various platform integrations, An understanding of data flows (ID types, ID syncs, pixel tracking, people-based destinations), You should be familiar with the following technologies and environments:, Technologies:, DSP Platform (Trade Desk, Double Click Bid Manager, and so on), Excel, Tableau and similar tools (Power BI, Qlik), Ad Server (Double Click Campaign Manager), Adobe/Google Analytics, Adobe Experience Platform, The BAAAM tool, Environments:, Small/Medium/Enterprise level business, Digital marketing, Data and analytics",
        "study_materials": "Section 1: Segment creation and syndication (25%): Determine the appropriate method to create segments utilizing first-, second-, and third-party data for targeting and analytical purposes, Given a scenario, recommend segments for activation that align to business or campaign goals, Determine the appropriate method to syndicate segments to destinations for activation, Differentiate between the different types of destinations, ; Section 2: Trait creation (17%): Recommend traits for a given audience strategy, Determine the correct method to create and update rule-based and/or onboarded traits, ; Section 3: Reporting and measurements (22%): Given a scenario, analyze reports to provide actionable next steps to meet business goals, Given a scenario, analyze audience optimization, ; Section 4: Troubleshooting and administration (26%): Given a scenario, verify audience delivery information to ensure scheduled delivery needs, Determine the appropriate practice to validate offline inbound files, Given a scenario, determine the correct method to perform QA against the ID sync, Determine the appropriate method to navigate and activate from the Adobe Audience Marketplace, ; Section 5: Taxonomy (10%): Determine the appropriate structure to create traits and segments that utilize a clear and consistent nomenclature, Determine the correct technique to maintain an organized platform using a clear folder structure, ",
        "details": "EXAM ID:AD0-E457; LEVEL:Expert (1-3 years experience); COST:$225 (global) and $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:36/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Developer Professional (NEW)": {
        "type": "certificate",
        "category": "Adobe Commerce",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should have atleast six months to a year of hands-on experience with Adobe Commerce., You should have a basic understanding of Adobe Commerce development, architecture, EAV/database, checkout and sales, catalog, and admin UI., Additionally, you should be familiar with the following technologies and environments:, Adobe Commerce - version 2.4.7, Good understanding of PHP, Knowledge of MYSQL, Knowledge of Object-Oriented Programming, Knowledge of Cloud Architecture, Design patterns used in Adobe Commerce",
        "study_materials": "Section 1: Architecture (52%): Describe module file structure, Describe Adobe Commerce CLI commands, Describe CRON functionality, Describe index functionality, Describe localization, Explain components (plugin, preference, observers etc.), Describe URL rewrites, Describe the Magento caching system, Describe stores, websites, and store views, Recall the code architecture of admin panel, Describe attributes and attribute sets, ; Section 2: Customizations (36%): Demonstrate knowledge of how to operate the catalog, Explain check out and sales operations, Manipulate entity types programmatically, Identify the data flow in and out of Adobe SaaS services, Identify API features, ; Section 3: Cloud (12%): Describe Adobe Commerce Cloud architecture, Describe the setup and configuration of Adobe Commerce Cloud, Recall the Adobe Commerce Cloud CLI tool, ",
        "details": "EXAM ID:AD0-E724; LEVEL:Professional (6-12 months' experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:39/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Audience Manager Architect Master": {
        "type": "certificate",
        "category": "Adobe Audience Manager",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have at least 3 years of experience with data collection methods, data management platforms, and digital marketing technology stacks across Adobe and non-Adobe marketing platforms. You understand clients unique technical and business requirements and develop customized solutions., Additionally, you should be able to complete the following tasks:, Analyze business requirements to understand existing data and the additional data that is required, Design and develop specific implementations to meet customer requirements, Implement Adobe Audience Manager using different methodologies, Create segments, Activate audience segments across different Adobe and non-Adobe cloud solutions, Generate and analyze different reports within Audience Manager, Understand data collection strategies",
        "study_materials": "Section 1: Implementation analysis (26%): Determine how to guide and support implementation of AAM as a stand-alone product or as part of a cloud solution, Analyze outbound destination options and recommend an AAM implementation approach, Determine a data onboarding strategy for a business use case, Identify features such as visitor profile viewer, tags, RBAC, and so on, to align with business goals, Determine how to design and test pixels required to create segments and traits, ; Section 2: Solution design and recommendations (18%): Determine AAM capabilities based on customer use case for audience and activation, Apply procedural concepts to utilize audience identity solutions to complement design architecture, Identify attribute and behavioral data and map it to specific business use cases, Apply procedural concepts to design folder taxonomy and naming convention, ; Section 3: Segmentation and activation (30%): Apply procedural concepts to create destinations in Audience Manager, Identify signals to create Rule-Based, Onboarded, and Algorithmic Traits, Apply procedural concepts to create segments using frequency/recency, Determine how to create segments using profile merge rules, Apply procedural concepts to create an algorithmic or predictive model, Determine segmentation logic based on use cases, ; Section 4: Privacy and data governance (8%): Recommend Audience Manager capabilities as it relates to governance, privacy, and security, Identify customer data policies that are in line with government regulations, ; Section 5: Performance and reporting (18%): Determine how to configure reports in AAM to gather signal, traits, and segment performance per business requirements, ",
        "details": "EXAM ID:AD0-E454; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:29/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Analytics Developer Professional": {
        "type": "certificate",
        "category": "Adobe Analytics",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should have:, 6-12 months experience in Adobe Analytics implementation (web and mobile app), Experience supporting Analytics Implementation teams in bridging between IT and the business to understand how business requirements translate into a technical solution (SDR), and based on requirements provided by the analyst, Understanding of which type of variable is needed, where and how to collect the data, design the data model (data layer), configure, and maintain the tag management solution, You should also have experience with the following tasks:, Interpreting a Solutions Design Document (SDR) and understanding the purpose of all Adobe Analytics variables collected, Understanding and work with Adobe (Experience Platform) Launch, Understanding configuration of baseline Adobe Analytics dimensions and events Page Name, Link Name, Activity Map, and so on, but will work with expert developers for more customer implementations - Variable mapping is still owned by Expert level developers, Creating and configuring rules within Launch following the design provided by an AA expert, Testing and validating the data being captured in variable and events firing by leveraging web console debuggers or mobile app systems like charles logs, Understanding what a data layer is and knows how to read a JavaScript object, Sharing reports, segments, and the process to request access, but not how to manage user groups, governance protocols, as well as manage the SDR, Providing guidance and configuring mobile/SDK solution, Understanding general framework behind Video tracking (event-based) given knowledge base documentation, Performing basic reporting from Analysis Workspace and understanding the data outputs available from the Adobe Analytics Data Warehouse, Basic experience with Adobe Experience Platform Launch (Adobe Launch)",
        "study_materials": "Section 1: Analytics in the Adobe Experience Cloud Eco-system (14%): Identify features and capability of Adobe Experience Cloud ID., Identify uses for Adobe Launch., Identify how to enable/support Adobe Analytics tags in the Adobe Experience Cloud Eco-system., ; : Identify features and capability of Adobe Experience Cloud ID., Identify uses for Adobe Launch., Identify how to enable/support Adobe Analytics tags in the Adobe Experience Cloud Eco-system., ; Section 2: Analytics Strategy and Design based on an SDR (12%): Given a Solution Design Reference, identify which data objects have to be populated., Given a part of a Tech Spec document, identify how to implement the data capture., ; Section 3: Analytics Implementation and Configuration (30%): Identify the steps to deploy Adobe Analytics Code., Identify functions of minimal deployment code for Analytics tracking., Identify the steps to configure various components within Adobe Analytics UI., Identify functions of Adobe Analytics report suite and variable settings., Identify the characteristics of a data layer and data layer values., Identify App Measurement functions for tracking features such as link tracking and e-commerce tracking., ; Section 4: Tag Management Systems (18%): Identify if requirements have been met using tag audits., Identify the steps to configure website tagging with Adobe Launch., Given a scenario, identify how to enable, modify, and troubleshoot extensions in Adobe Launch., Identify how to create rules and data elements., ; Section 5: Components of Adobe Analytics (8%): Identify the functions of Adobe Analytics API (data feed, warehouse, data sources, reports)., Identify the characteristics of processing rules., ; Section 6: Testing, Validation, and Troubleshooting (18%): Identify the meaning of common JavaScript errors., Identify the meaning of common Adobe Analytics variables errors., Given a scenario, identify testing and debugging validation best practices that should be followed., Identify how to track an Adobe Analytics server call (i.e. From beacon request to showing up in the report.), ",
        "details": "EXAM ID:AD0-E213; LEVEL:Professional (0-12 months experience); COST:$125 (global) and $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Customer Journey Analytics Developer Expert": {
        "type": "certificate",
        "category": "Adobe Customer Journey Analytics",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have 12-24 months experience in Adobe Customer Journey Analytics, and be able to perform the following tasks:, Read and understand XDM schema (classes), Demonstrate a familiarity with the platform interface, Validate data (query service), seeing your data in a dataset, Understand required Admin permissions for different access levels, Read and understand a QA script, Define a QC script to hand off to AEP engineer, Configure connections with primary identities (person ID), Configure connections with multiple datasets, Configure a data view (Metric/dimension configuration), Configure Adobe Customer Journey Analytics, Transform data within the dimensions and metrics, Analyze Workspace basics (visualizations, attribution settings, filters, calculated metrics), Understand data governance in CJA (DULE), Build across channel metrics or people-based filters, Distinguish/understand sandboxes in AEP, Understand audience publishing (sharing)",
        "study_materials": "Section 1: Connections (22%): Design CJA connections with appropriate settings, Create CJA connections from XDM data sets available in AEP by sandbox, ; Section 2: Data Views (30%): Configure data views for reporting and analysis, Modify components within data views, ; Section 3: Data Validation and Troubleshooting (34%): Validate that data is populating accurately and completely, Troubleshoot connections and data views, Build or troubleshoot components, Monitor usage to licensure, ; Section 4: Reporting and Activation (14%): Use Analysis Workspace to demonstrate cross-channel customer journeys with appropriate visualizations, Send the members of a CJA Filter to an RTCDP Audience, Design and create filters across datasets, ",
        "details": "EXAM ID:AD0-E604; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Campaign Classic Architect Master": {
        "type": "certificate",
        "category": "Adobe Campaign Classic",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have:, Experience with multiple Adobe Campaign Classic implementations, An understanding of how Adobe Campaign works as a digital marketing solution and implements it based on project requirements, The ability to create a functional design document, The ability to create a functional scope of work for an Adobe Campaign installation, The ability to provide the technical roadmap including LEO and task dependencies, The ability to provide technical requirement information for the project scope and timeline, Experience with business requirements workshops, Experience in leading solution design workshops, The ability to evaluate multiple solution approaches and provide recommendations, The ability to review existing campaigns and processes on other platforms to determine needs for the Adobe Campaign implementation, The ability to describe and demonstrate product features and capabilities, The ability to map product capabilities to high use cases, Experience in supporting the pre-sales team, The ability to offer deskside coaching (product best practice, reporting metrics, and so on), Experience in describing the differences between deployment models",
        "study_materials": "Section 1: Solution definition (24%): Given specific business requirements, determine the information relevant to solution design, Given a scenario, provide performance, infrastructure, and configuration recommendations, Analyze Campaign Classic setups to advise on improvements, Determine business requirements to design a digital marketing solution, Given a scenario, specify the correct product deployment method, ; Section 2: Data landscaping (24%): Specify the Data Model and integration map design parameters for a Campaign solution with other customer tools, Given a scenario, determine the solution design required to comply with laws and regulations, Given a scenario, determine the optimal technical workflow design, ; Section 3: Installation and management (16%): Given a set of key modules, validate the configuration of the module set-up, Given a scenario, recommend integration solutions to enable native and third-party integrations with Adobe Campaign Classic, Given a scenario, determine diagnostic methods, Given a scenario, advise on the appropriate hardware infrastructure needed during solution design, Given a scenario, determine the correct method for solution promotion to the respective environment, ; Section 4: Project leadership (10%): Given customer requirements, determine the appropriate activities and resources needed, Given a scenario, analyze the overall solution to determine technical risks, assumptions, issues and dependencies, Communicate technical ACC expertise to internal and external teams, ; Section 5: Customization (26%): Analyze and design custom features, Analyze and design custom integrations, Determine the correct method to design complex campaign templates and workflows, Determine the correct method to design solutions using additional modules, ",
        "details": "EXAM ID:AD0-E328; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Front-end Developer Professional": {
        "type": "certificate",
        "category": "Adobe Commerce Front-End",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should have 0-12 months of hands-on experience with Adobe Commerce Front-end development and the ability to work with technical solutions to deliver individual components., Additionally, you should exhibit knowledge of the following technologies:, Strong understanding of Adobe Commerce version 2.4.6, Basic understanding of the front-end structure and layout, Experience and understanding of HTML, CSS (and preprocessors), LESS, JavaScript and UI Components, jQuery, Underscore, Require.JS, Knockout, also PHP templates, DB knowledge and content management, Familiarity with the platform, CMS Blocks, Widgets, CMS pages, Category pages, Product pages, Cart and Checkout, and Account Dashboard area, Basic understanding or knowledge of admin configurations, Knowledge of extending and overwriting styles, layouts, and JS files, Extending parent themes/Theme hierarchy, CLI command (cache cleaning, setup:upgrade, indexers, deployment mode) & Grunt, Caching technologies, client-side browser, understanding storages (Cookies, local storage), Understanding responsive design and media queries, WYSIWYG/Page Builder, Understanding code packages, Implement translation, Understanding how to work with email templates, Basic understanding of XML, Basic understanding of out-of-the-box SEO, optimization and performance techniques, Basic understanding of canonical links, as well as merging JavaScript and CSS, Basic understanding of Adobe Commerce cloud infrastructure",
        "study_materials": "Section 1: Theme management (Theme hierarchy, image configuration, translations) (14%): Describe Adobe Commerce theme folder structure, Demonstrate ability to create new or extend existing themes, Demonstrate ability to add custom translation phrases, ; Section 2: Layout XML & templates (30%): Demonstrate the ability to work with basic layout XML instructions, Demonstrate the ability to use existing page layouts, Describe the steps for extending and overriding XML, Demonstrate ability to create and customize templates, Describe template security (escaping output), ; Section 3: Styles (22%): Describe the purpose of styles-m.less, styles-l.less, print.less, Describe the difference between specific partial files (_extends.less,_extend.less,_theme.less,_widgets.less,_module.less), Given a scenario, demonstrate the ability to override or extend Magento LESS, Describe the basic concepts of LESS, Explain the hierarchy of styles (lib, modules, themes), Explain client-side and server-side compilation, ; Section 4: JavaScript (18%): Demonstrate the ability to initialize and call JavaScript components, Demonstrate the usage of RequireJS, Describe the usage of mixins, Describe how to add a translation in JS, Describe the usage of Knockout JS, Describe the usage of jQuery widgets, ; Section 5: Admin configuration and Page Builder (6%): Demonstrate the ability to customize Page Builder and CMS content\", Apply/schedule a theme to a specific scope (website, store, store-view), Apply design changes to categories, products and CMS pages using admin configuration, Describe steps to customize transactional emails, ; Section 6: Tools (CLI and Grunt) (8%): Describe the usage of basic bin/Magento commands, Describe the usage of Composer commands (install, update, require, remove), Differentiate the appropriate use case for deploy modes, Describe additional tools that cloud provides (Fastly, downloading database, content deployment), ",
        "details": "EXAM ID:AD0-E721; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Commerce",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "You should have approximately 1-3 years of hands-on Commerce experience and a broad understanding of the e-commerce experience., You should have experience in:, Digital marketing: SEO, CMS, sales techniques like cross-selling and up-selling, understanding Google Analytics, email templates, Security, compliance, and privacy laws, such as PCI, GDPR, ADA, CAN-SPAM, PSD2, Sales/marketing strategies like omnichannel and multichannel, Experience in project management, requirements gathering, integration flows, general e-commerce laws, software development methodologies, and monitoring, Understanding of business, commerce/e-commerce, and logistics, Basic understanding of customizable applications, cloud, and server infrastructure, Modern e-commerce terminology, Additionally, you should be comfortable using the following technologies:, Adobe Commerce - version 2.4, Analytics and performance tools: Google Analytics, tag manager, SWAT, New Relic, Fastly, Google Lighthouse, Security tools: PCI compliance, ADA, GDPR, and so on, Cloud or on-premise architecture",
        "study_materials": "Section 1: Core Features/General Configuration (46%): Identify the features of Adobe Commerce Open Source Edition and Commerce Edition, Distinguish the differences between all editions of Adobe Commerce products, Determine how to utilize product types and their features to meet customer requirements, Interpret requirements and mock ups to determine if they can be met with native functionality, Demonstrate knowledge of the admin panel and the location of common features, Demonstrate the ability to import/export Adobe Commerce entities, Understand how to natively configure cart and checkout, Evaluate the native available shipping methods in Adobe Commerce and how they apply to common use cases, Understanding the ways to create and publish stylized content using the Adobe Commerce CMS features including Page Builder, Using native tools to manage the order life cycle, Demonstrate the ability to configure the various gifting options (gift cards, gift wrapping, give messages), Configuring and modifying transactional emails, Explain the customer self service and loyalty program native features in B2B, ; Section 2: Merchandising (10%): Demonstrate the ability to create promotions to meet specific business criteria and how it determines final pricing, Demonstrate ability to manage categories and products, Understand the different pricing configurations and how they affect the final price, ; Section 3: Digital Marketing (4%): Recommend best practices for SEO using native features, Assess common metrics in Google Analytics and BI, ; Section 4: Add-on Modules and Additional Products (18%): Describe the B2B functionality and how it relates to common B2B scenarios, Apply business requirements to suggest a solution using MSI, Explain the advantages and how to use BI to the Adobe Commerce solution, Distinguish the differences between native search and LiveSearch, Apply business requirements to determine how to apply taxes, duties and exemptions in a B2B environment, Understand how to apply tailored pricing to a B2B customer, Understand the differences between Adobe Commerce native product and Adobe Sensei product recommendations, ; Section 5: Systems Architecture (10%): Evaluate requirements to determine which websites, stores, and store view are necessary, Identify and analyze performance metrics to make improvements, Understand the available methods to integrate external system with Adobe Commerce, Differentiate between headless approaches and traditional, ; Section 6: Compliance/Security (12%): Demonstrate how to secure the Adobe Commerce data access with roles and permissions, Understand the basics of compliance for privacy laws and payment security, Explain common security aspects of an Adobe Commerce project, Understand the basics of tax laws and how to configure, ",
        "details": "EXAM ID:AD0-E708; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Workfront Project Manager Professional": {
        "type": "certificate",
        "category": "Adobe Workfront Project",
        "level": "Professional",
        "job_role": "Manager",
        "prereq": "You should have:, An understanding of work process from an initial work request through completion or has had exposure to project or work management, Completed self-guided training or bootcamp or have been a Workfront user for 6-12 months so they understand basic functionality, An understanding of how to configure, track, and monitor report data",
        "study_materials": "Section 1: Intake and planning (30%): Identify different ways to be notified of a work request, Given a request, review the custom data to determine the appropriate action, Given a scenario, determine the sharing permissions that are required for an activity, Given a scenario, determine the appropriate task settings to plan the execution of a task in a specific time frame, Identify ways to locate key data on a project, Identify different ways to track project risk, Identify the correct hierarchy of objects in Workfront, Identify the appropriate field to view a specific assigned resource, Given a persona, determine the intake or planning reports/dashboards that are helpful for the persona during the work intake or planning stage of the project/work process, ; Section 2: Execute (50%): Identify ways to understand, apply, and measure of Milestones on a Project, Create Workfront Single Use Approvals and when an Approval would be used, Identify how different date types are used by the system, Given a scenario, identify the information that date types convey to a project manager, Given a scenario, determine how different Task Constraints affect the project timeline when used, Given a scenario, demonstrate how to find project teams and how to notify them of work assignments, updates, or completion of work items, Given a scenario, describe how to upload a document and generate a proofIdentify the different ways to manage a projectGiven a scenario, determine the Planned Variance for a specific job role within an individual projectGiven a scenario, locate the specific financial element in WorkfrontGiven a Gantt chart, explain the object relationships on the chartCompare differences between Condition and Progress StatusIdentify how Workfront teams and Workfront groups can be usedGiven a scenario, describe how to provide stakeholders the information they requireGiven a scenario, determine how date types and durations impact project conditionsGiven a scenario, determine the custom statuses are requiredIdentify the various types of reports available within WorkfrontGiven a scenario, describe the steps to build a custom report, Identify the different ways to manage a project, Given a scenario, determine the Planned Variance for a specific job role within an individual project, Given a scenario, locate the specific financial element in Workfront, Given a Gantt chart, explain the object relationships on the chart, Compare differences between Condition and Progress Status, Identify how Workfront teams and Workfront groups can be used, Given a scenario, describe how to provide stakeholders the information they require, Given a scenario, determine how date types and durations impact project conditions, Given a scenario, determine the custom statuses are required, Identify the various types of reports available within Workfront, Given a scenario, describe the steps to build a custom report, ; Section 3: Closeout (20%): Given a particular object status, determine what activities need to be executed or what actions are triggered, Given a scenario, determine the type of report and the reporting element to use to modify a task list or report, Identify the different wildcards that can be used in reporting, Identify the project elements that can be used to measure project success, ",
        "details": "EXAM ID:AD0-E903; LEVEL:Professional (6-12 months' experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:45/70; TIME LIMIT:2 hours 20 mins"
    },
    "Adobe Experience Manager Forms Developer Expert": {
        "type": "certificate",
        "category": "Adobe Experience Manager Forms",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have:, 1-3 years of experience with AEM FormsAt least 5 years of work experience in the IT industryThe ability to lead the development, configuration, testing, and deployment of customized forms solutionsThe ability to configure a form, translate business requirements into workflows, integrate with external systemsAn understanding of AEM Forms foundation components, At least 5 years of work experience in the IT industryThe ability to lead the development, configuration, testing, and deployment of customized forms solutionsThe ability to configure a form, translate business requirements into workflows, integrate with external systemsAn understanding of AEM Forms foundation components, The ability to lead the development, configuration, testing, and deployment of customized forms solutionsThe ability to configure a form, translate business requirements into workflows, integrate with external systemsAn understanding of AEM Forms foundation components, The ability to configure a form, translate business requirements into workflows, integrate with external systemsAn understanding of AEM Forms foundation components, An understanding of AEM Forms foundation components, Additionally, you should be familiar with the following technologies and environments:, Design XDP templates, XFA templatesCreating PDF Forms (static/dynamic, interactive and non-interactive)Schema or XML data bindingCreate Form FragmentCreate an Adaptive FormDebugging of Complex FormConfigure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Creating PDF Forms (static/dynamic, interactive and non-interactive)Schema or XML data bindingCreate Form FragmentCreate an Adaptive FormDebugging of Complex FormConfigure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Schema or XML data bindingCreate Form FragmentCreate an Adaptive FormDebugging of Complex FormConfigure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Create Form FragmentCreate an Adaptive FormDebugging of Complex FormConfigure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Create an Adaptive FormDebugging of Complex FormConfigure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Debugging of Complex FormConfigure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Configure and perform forms submissionBuild and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Build and Deploy AEM instances for adaptive formsUse form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Use form modelAbility to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Ability to integrate with data servicesWorkflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Workflow implementationBasic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Basic understanding of AEM forms workbench (JEE) to create long live - short live processes and services.Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Develop JavaScript clientlibs using GuideBridge APIBased on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Based on sign v government CAC know which AEM Forms environment desktop or server based to useBasic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Basic understanding of Java/J2EE and JavaScript to write logic and call different services.Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Prefill an adaptive formBasic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Basic understanding or knowledge of OSGi, Sling componentsUse of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Use of Document ServicesAEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, AEM Designer, AEM workbench, AEM workspaceAdaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Adaptive forms consoleJava IDE ToolsMavenGIT/Versioning tools, Java IDE ToolsMavenGIT/Versioning tools, MavenGIT/Versioning tools, GIT/Versioning tools",
        "study_materials": "Section 1: Forms creation and management (36%): Build FormsConfigure Forms Data Model Customize AEM Forms Develop and use JavaScript ClientLib leveraging GuideBridge API, Configure Forms Data Model Customize AEM Forms Develop and use JavaScript ClientLib leveraging GuideBridge API, Customize AEM Forms Develop and use JavaScript ClientLib leveraging GuideBridge API, Develop and use JavaScript ClientLib leveraging GuideBridge API, ; Section 2: Processes and workflows (34%): Design and orchestrate a Form approval workflow Develop an OSGi bundle using Document Services APISchedule different asynchronous batch processes using Watchfolder endpoint Produce different output from XFA/XDP design Manipulate PDF using Forms or Assembler services Implement JDBC services, Develop an OSGi bundle using Document Services APISchedule different asynchronous batch processes using Watchfolder endpoint Produce different output from XFA/XDP design Manipulate PDF using Forms or Assembler services Implement JDBC services, Schedule different asynchronous batch processes using Watchfolder endpoint Produce different output from XFA/XDP design Manipulate PDF using Forms or Assembler services Implement JDBC services, Produce different output from XFA/XDP design Manipulate PDF using Forms or Assembler services Implement JDBC services, Manipulate PDF using Forms or Assembler services Implement JDBC services, Implement JDBC services, ; Section 3: Administration and troubleshooting (18%): Troubleshoot and differentiate log files Perform administration activities Apply Service Packs Perform AEM Dispatcher setup for FormsNavigate different consoles, Perform administration activities Apply Service Packs Perform AEM Dispatcher setup for FormsNavigate different consoles, Apply Service Packs Perform AEM Dispatcher setup for FormsNavigate different consoles, Perform AEM Dispatcher setup for FormsNavigate different consoles, Navigate different consoles, ; Section 4: API endpoints and integrations (8%): Integrate with Adobe Experience CloudGenerate and consume various endpoint services, Generate and consume various endpoint services, ; Section 5: Interactive Communication (4%): Design, demonstrate, and implement processes for the Interactive Communication, ",
        "details": "EXAM ID:AD0-E125; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:27/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Campaign Classic Developer Expert": {
        "type": "certificate",
        "category": "Adobe Campaign Classic",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have:, At least two years of Campaign software experience, At least three years of combined experience in JavaScript programming, SQL development including ETL, and web technologies (XML, HTML and web services), Experience executing a marketing campaign using digital omnichannel, Experience with database architecture and knowledge of database marketing, Ability to map requirements to Campaign functionality, Ability to troubleshoot Campaign implementations, Basic understanding of server configurations related to Campaign",
        "study_materials": "Section 1: System configuration (16%): Apply system-wide configuration settings and defaults, Given various parameters, select the appropriate Adobe Campaign feature to implement a use case, Troubleshoot system configuration settings, Implement custom configurations, Identify Campaign Control Panel configuration features, ; Section 2: Customization (22%): Given a set of requirements, apply best practices to design a data model, Describe the implementation of APIs in Campaign, Describe best practices for developing with JavaScript in Adobe Campaign, Apply JavaScript libraries in workflows, SOAP calls, typology rules, and personalization blocks, Describe best practices for using SQL functions in Adobe Campaign Classic, Given a scenario, understand how to use SQL scripts in Adobe Campaign Classic, Describe commonly used OOTB functions, ; Section 3: Access management (8%): Given a scenario, configure security settings for an operator, Describe how to configure access management settings based on the solution design document, Describe access management using the Campaign Control panel, Identify the limitations of data partitioning and when to use sysfilter, ; Section 4: Data integration (16%): Given a scenario, select the best approach to integrate with external data sources, Implement best practices for workflow data processing, Apply data integration techniques within a workflow, Identify security and network settings to integrate with Adobe Campaign from an external system, Set up the CRUD process on a schema from outside of Adobe Campaign, ; Section 5: Instance maintenance (12%): Understand and act on the Workflow heatmap, Demonstrate the process to create a custom workflow or report for instance monitoring, Identify problems based on system indicators, Explain the impact of services and processes on the system, Demonstrate basic system audit metrics/checks, ; Section 6: Campaign configuration (25%): Apply advanced personalization techniques, Configure and apply custom target mappings, Identify appropriate JavaScript usage in the Campaign workflow and why, Apply custom code to manipulate temp tables and workflow context, Validate and debug workflow logic, Apply advanced delivery settings, Describe workflow practices that have a negative impact on performance, Given a use case, recommend complex targeting workflow design, ",
        "details": "EXAM ID:AD0-E330; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:34/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Campaign Classic Developer Professional": {
        "type": "certificate",
        "category": "Adobe Campaign Classic",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should have:, At least one year of Adobe Campaign Classic software experience, At least one year of combined experience in JavaScript programming, SQL development including ETL, and web technologies (XML, HTML and web services), A basic understanding of marketing automation, An understanding of relational database concepts",
        "study_materials": "Section 1: System configuration (25%): Demonstrate system-wide configuration of settings in the Administration node, Apply the process to extend the OOTB Recipient schema, Define schema details (primary keys, auto primary keys, database indexes), Distinguish the applicable uses of Form Renderings, Distinguish system-wide configuration settings that affect the workspace/project level, Identify configuration settings for SFTP external accounts, Identify the configuration settings for Open and Closed enumerations, Differentiate Typology Rule Types, Identify requirements to utilize a custom Target Map and its effects to OOTB functionality, Describe how externally generated audiences from other Adobe Experience Cloud solutions are accessed in Adobe Campaign Classic, Describe the business use case for interactions and offers, Describe the business use case for Message Center, Identify V8 API data import functionality, ; Section 2: Customization (16%): Apply the process to edit Campaign schemas, Identify the settings to ensure correct schema extension or configure custom schemas, Describe the use case for customized Options, Describe the use case for Seedlists, Modify the OOTB opt-out / Unsubscribe web app, Apply the process to create Content Management components, Identify the use cases to use Content Management, Apply to process to update the OOTB forms, ; Section 3: Operational security (10%): Describe the process for adding user groups and roles, Apply the process to translate the user management matrix with correct user rights and hierarchy, Identify and define the correct permissions, Identify the security zone for a user group, ; Section 4: Technical Workflows (29%): Apply the process to import/export, Identify the different sources of data that a workflow can access, Apply the process to transform data and manipulate the work table, Enumerate applicable workflow activities and their features/properties, Apply the process to configure workflow properties, Extend activity functionality using the Expression Editor, Distinguish the difference between the OOTB workflows and user-created workflows, Explain the purpose of the OOTB workflows, Troubleshoot custom workflows, Differentiate between variable types and their scope and usage, Identify the OOTB variables and their use, Apply the process to configure alerts and approvals, Identify types of campaign databases, ; Section 5: Instance Maintenance (4%): Identify errors from different service logs, Explain Workflow Heatmap readings, ; Section 6: Campaign configuration (14%): Apply the process to create campaigns using Campaign templates, Describe the process to create approvals, Identify errors by analyzing audit logs, Identify the usage of different deliveries, given a campaign scenario, Define the process to create the advanced process in workflows, Describe workflow execution methods, ",
        "details": "EXAM ID:AD0-E331; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Target Architect Master": {
        "type": "certificate",
        "category": "Adobe Target",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have:, At least three years of digital marketing optimization experience, At least two years experience (or five engagements) implementing, deploying, and troubleshooting Adobe Target, Experience integrating Target with the Adobe Experience Cloud, Fundamental understanding of JavaScript, HTML, CSS, and front-end web development, Familiarity with/awareness of Adobe Target APIs/SDKs, server-side integration, reporting and administration, Knowledge of implementing Adobe Target with Single Page Application (SPA) frameworks, mobile and email, and recommendations., Technologies:, Multiple Adobe Experience Cloud Programs (Adobe Analytics, Adobe Campaign, Adobe Experience Manager, Adobe Experience Cloud Debugger, Target APIs), JavaScript (Ajax, JQuery, and so on), Browser-based debugging tools (Chrome developer tools, VEC helper), JSON for debugging responses from Target, Debugging tools for native apps (Charles Proxy, Fiddler), HTML, CSS, HTTP, XML configuration, Native mobile development IDEs, basics of iOS development, basics of Android development, API tools like Postman, VEC helper, Environments:, Adobe Experience Cloud, Client-side implementation without tag manager, Tag Management Systems, especially Launch (IF), Server-side environments (for API usage), Email, Web and mobile environments, AMS hosted environment, Adobe I/O Runtime",
        "study_materials": "Section 1: Adobe Target fundamentals (13%): Identify the appropriate Adobe Target usage for a given scenario, Explain the fundamental technologies of an Adobe Target implementation, ; Section 2: Integrating with Adobe Target (18%): Apply the process to integrate Adobe Target with Adobe Analytics (A4T), Apply the process to integrate Adobe Target to Adobe Experience Manager, Describe integration with Adobe Experience Cloud Solutions and Adobe Experience Platform solutions, Describe the integration with Adobe Experience Cloud Audiences, ; Section 3: Adobe Target administration and governance (6%): Define an ongoing Adobe Target implementation strategy and system governance, Apply the process and best practices to manage users, Describe the administration aspects of the implementation setup, ; Section 4: Adobe Target and supported touch points (6%): Describe client-side delivery implementation, Describe server-side delivery implementation, Describe implementation requirements for mobile, email targeting, and APIs, ; Section 5: Leverage Adobe Target recommendations (11%): Demonstrate an understanding of recommendations, catalogs, and criteria, Apply the process to configure Target recommendations, ; Section 6: Architect, design and implement Adobe Target (18%): Select the correct Target Request implementation (Global, Order Confirm, Hybrid), Evaluate and design an Adobe Target implementation, Describe the implementation of Adobe Target in Native Mobile Apps, ; Section 7: Troubleshooting (28%): Troubleshoot mbox errors, Troubleshoot Target Request and Response errors, Troubleshoot activity setup errors, Understand integration errors, Troubleshoot Adobe Target Recommendations Errors, ",
        "details": "EXAM ID:AD0-E409; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Analytics Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Analytics",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, 2 years experience in Digital Analytics with a marketing background, An in-depth understanding of Digital Analytics metrics and dimensions, An understanding of the business value of web technologies, The ability to translate business requirements into metrics or KPIs, The ability to build and interpret reports, The ability to communicate results and can propose a course of action based on analysis of reports, Helped clients understand how to extract/pull the information they want (for example, help them define their business questions), An understanding how the technology works and understands a clients implementation (for example, where the data sits, how it can be collected, how it is tracked) from a functional standpoint, At least one year of Adobe Analytics hands-on experience, A basic understanding of how Digital Analytics is filtering/structuring data, An awareness of the integration of Adobe Analytics with other Adobe solutions, Additionally, you should be familiar with the following technologies and environments:, FTP client, Current Adobe Analytics Workspace features and other reporting options outside of Workspace (ex. schedule projects and schedule reports), Debugging tools relevant to Adobe Analytics (Packet monitor such as an Adobe Debugger, browser developer tools, Charles), Admin Console (Analytics Reports Suite Admin Console and Experience Cloud Admin Console), Adobe Launch fundamentals/basics, Apps, SPA, basic website understanding, Mobile services UI, Adobe Help Center, Data export options (ex. right click to export, .csv download, Data feeds, Data Warehouse extract)",
        "study_materials": "Section 1: Business Analysis (26%): Given a business need/question, identify the most appropriate reporting strategy to perform an analysis, Analyze data to answer business questions and recommend new optimization hypotheses, Identify conversion funnels, , Demonstrate Solution Design Reference (SDR) to determine what data is available in reports, , Analyze report data to summarize and draw conclusions, , Investigate outliers and anomalies in reports, ; : Consider the advantages of using a reporting tool based on a given scenario, Compare fallout and flow visualization and appropriate variable types for reporting, Apply the process to schedule Projects and Data Warehouse, Apply the process to share Projects and Reporting and Analytics dashboards for different users and/or groups, Apply the process to set Alerts, Apply the process to lookup the dimensions/components, Apply the process to create a visualization, Given a scenario, determine the appropriate item to use, Apply the process to create, configure, and use mobile scorecards, ; Section 2: Reporting and dashboarding for projects (30%): Consider the advantages of using a reporting tool based on a given scenario, Compare fallout and flow visualization and appropriate variable types for reporting, Apply the process to schedule Projects and Data Warehouse, Apply the process to share Projects and Reporting and Analytics dashboards for different users and/or groups, Apply the process to set Alerts, Apply the process to lookup the dimensions/components, Apply the process to create a visualization, Given a scenario, determine the appropriate item to use, Apply the process to create, configure, and use mobile scorecards, ; Section 3: Segmentation and calculated metrics (22%): Determine how to develop and configure segments, Apply the process to share segments with others in the organization, Compare segments, Apply segments to Projects and Components, Apply the process to generate calculated and/or segmented metrics, ; Section 4: General tool knowledge and troubleshooting (12%): Analyze reports and identify data quality issues, Define different types of dimensions and parameters existing in Adobe Analytics (eVars, props and events), Determine how to bring data in and out of Adobe Analytics, Identify information from marketing URLs, ; Section 5: Administration (10%): Apply the process to configure the Marketing Channel reports with Marketing Channel processing rules, Apply the process to configure Classification Importer and Rule Builder, Apply the process to configure a virtual report suite based upon an existing segment, Use the Data Feed Manager Admin UI, Understanding of data governance, ",
        "details": "EXAM ID:AD0-E208; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:2 hours"
    },
    "Adobe Journey Optimizer Developer Expert": {
        "type": "certificate",
        "category": "Adobe Journey Optimizer",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "At a minimum, candidates ready to become Adobe Journey Optimizer Developer Experts should have at least one year experience working with various CDP and marketing automation systems. They should also be able to guide the development/implementation from scratch; troubleshoot journeys, know the limitations and Guardrails of the product, use advanced code, set templates, build custom actions, and know best practices., Adobe Journey Optimizer is powered by Experience Platform. Candidates seeking to become certified experts are recommended to complete training or prior experience on Adobe Experience Platform or Real Time Customer Data Profile in addition to Adobe Journey Optimizer training.",
        "study_materials": "Section 1: Administration and Configuration (20%): Identify which permissions are necessary to perform various tasks, Describe the concept of the sandbox and how the data can be used across business units, Demonstrate an understanding of Channel Administration, Determine the appropriate application of Events/Actions/Data Sources, Identify when to use AJO specific APIs–throttling, capping, suppression, object copy, interactive message execution, ; Section 2: Journey Orchestration (22%): Given a scenario, target customers on a multi-channel/multi-step journey, Interpret reports and debug performance metrics, Given a scenario, determine the appropriate use cases for a journey type, Prepare test cases (for example, experimentation or multi-channel journey), ; Section 3: Offer Decisioning (16%): Demonstrate an understanding of creating and managing offers and components, Demonstrate how to use test profiles to run offer simulation, Explain the difference between Offer Hub and Edge API, Apply the process to create decisions, Apply the process to add offers on different channels, ; Section 4: Content Authoring (22%): Demonstrate how to create email, SMS, in app messages and push notifications, Interpret Helper functions and personalization syntax to show what would be displayed, Demonstrate an understanding of validating, proof, debug, and publishing a journey, ; Section 5: Data Modeling (18%): Differentiate between profile and event type Schemas, Explain how to set up data sources and data ingestion, Explain the difference between Schema, Datasets and Union Schema, Explain profile and identities, Given a scenario, determine the appropriate segmentation service, ",
        "details": "EXAM ID:AD0-E606; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Advertising Search Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Advertising Search",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, Experience as a program manager with 12-24 months of paid search performance industry, At least 3-6 months of Advertising Search Platform experience, Experience working in Advertising Search and are familiar with paid search bidding automation and campaign management, An understanding of Portfolio theory, You should also have experience working with the following functions:, Creating each aspect of Portfolio, Creating custom simulations to determine when portfolios are ready for optimization, Monitoring portfolio accuracy, Preparing portfolios to have sufficient data to optimize, Creating/pulling reports, tROAS bidding tactics, Hybrid bidding and optimization tactics, Setting up conversion tracking, Setting up objectives, Managing portfolio against a target, Building campaigns, Setting up account linking, Creating constraints, Setting up accounts, Managing campaigns, Use Spend Recommendation Tool, Excluding and Including Dates in Portfolios, Managing Bid Rules, Intra-day bidding, Audience bid-modifier, Location bid adjustment",
        "study_materials": "Section 1: Portfolios & optimizations (54%): Given a scenario, select and set up automated bidding strategies, Given business strategies, define and create Portfolio KPI objectives, Given business strategies, define and create appropriate Portfolio settings, Given performance needs, create and manage Constraints, Given a scenario, evaluate and troubleshoot Portfolio performance, Given a scenario, determine how to adjust Portfolio settings on an ongoing basis, ; : Given a scenario, select and set up automated bidding strategies, Given business strategies, define and create Portfolio KPI objectives, Given business strategies, define and create appropriate Portfolio settings, Given performance needs, create and manage Constraints, Given a scenario, evaluate and troubleshoot Portfolio performance, Given a scenario, determine how to adjust Portfolio settings on an ongoing basis, ; Section 2: Reports, insights, and tools (14%): Apply procedural concepts to create and schedule reports based on business needs, Determine optimal budget allocation using available Platform AI tools across Portfolios and apply if needed, Given a use case, create and define custom simulations for Portfolio analysis and forecast, ; Section 3: Campaign administration (22%): Set up accounts, Build, manage, and organize all aspects of campaigns, ; Section 4: Measurement (10%): Given a business scenario, determine an approach to campaign conversion tracking and apply, Given a scenario, troubleshoot campaign conversion metric issues, ",
        "details": "EXAM ID:AD0-E501; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:35/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Captivate Certified Professional": {
        "type": "certificate",
        "category": "Adobe Captivate",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should have:, Minimum of 3 months experience with content creation, Any experience in training content creation (including PowerPoint), Basic knowledge of instructional design, Awareness of eLearning course design or instructional design:, Trainers/Educators, eLearning course content developers, normally trained instructional designers, Graphic Designers, Learning theories, models, and principles, Needs, Task and Learner Analysis, derived from customer requirements, Writing objectives, Creating storyboards, Content segmentation, Designing interactions, Building scenarios, Writing assessment questions, Technical and conversational writing skills",
        "study_materials": "Section 1: Simulations (13%): Apply procedural concepts to create demo simulations, Follow steps to create training simulations, Follow steps to create assessment simulations, ; Section 2: Non-Interactive Content (21%): Customize Quick Start project, Customize content blocks, Use design options and themes, ; Section 3: Assessment (21%): Develop assessments, Configure reporting, ; Section 4: Interactions (24%): Customize built-in interactions, Develop interactive video modules, Develop custom interactions, Customize user interactive components, ; Section 5: Media and Accessibility (21%): Add and edit audio in a project, Add video to a project, Apply animations and transitions in a project, Use accessibility strategies, ",
        "details": "EXAM ID:AD0-L800; LEVEL:Professional (0-12 months experience); COST:$599 (global) / $199 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:38/50; TIME LIMIT:1 hour 40 min"
    },
    "Adobe Campaign Standard Developer Expert": {
        "type": "certificate",
        "category": "Adobe Campaign Standard",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have:, At least two years of Adobe Campaign Standard software experience, At least two years of relevant experience in multi-channel digital marketing campaigns and web development (such as, REST API), The ability to perform tasks in Adobe Campaign including template development, technical workflows, schema development, and integrations, and be able to monitor the instance using control panel, Experience working in a channel delivery environment (email, direct mail, mobile, and social), Familiarity with marketing campaign tactics such as multi-touch, life cycle, and reactivation, An understanding of marketing metrics such as ROI, click-through rates, and conversion., Experience administering a marketing automation platform, Basic knowledge of CSS, HTML, and JavaScript, emails, Basic knowledge of relational database and data modeling, An understanding of technical workflows and configured them, Experience extending a recipient table or schema and data management, Created typology rules, workflows, delivery and Campaign templates, Configured roles and rights, Experience with the administration console and integration with other Adobe applications, Awareness of Adobe I/O and Adobe I/O Runtime, Experience with transactional messaging, and message delivery on multi-channels, Experience with managed packages",
        "study_materials": "Section 1: Data modeling and management (26%): Given a scenario, transform a client requirement into a custom resource, Determine how to configure screen and filter definitions, Given a scenario, determine the correct strategy to define keys, indexes, and links, Determine the correct method to publish resource updates, Troubleshoot data modeling issues, Determine the correct approach to build technical workflows, ; Section 2: Campaign management (50%): Troubleshoot workflow errors, Determine the correct approach to build campaigns, Determine the correct approach to work with audiences and profiles, Apply and create filter rules through typologies, Determine the correct approach to create and manage templates, Determine the correct approach to configure landing pages, Determine the correct approach to work with services and subscriptions, Given a scenario, validate delivery mechanisms, Determine the correct approach to build emails using creative designer, Determine the correct approach to create custom reports, ; Section 3: Administration (24%): Determine the correct approach to create user security groups and organizational units, Determine the correct approach to manage and deploy packages, Determine the correct approach to configure external accounts, Determine the correct approach to configure options, Determine the correct approach to create brands, Determine the correct approach to develop channel configurations, ",
        "details": "EXAM ID:AD0-E306; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:29/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Assets Developer Professional": {
        "type": "certificate",
        "category": "Adobe Experience Manager Assets",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "You should be comfortable working in Adobe Managed Services and Adobe Experience Manager as a Cloud Service, and are able to set up Adobe Experience Manager environments and infrastructure., You should have:, 6 months+ CMS experience, 6 months+ AEM Assets experience, 6 months+ Java developer experience, On-premise and Cloud experience, Additionally, you should have experience with the following technologies and environments:, Cloud Manager, Adobe IO CLI, Git CLI, Cloud transition tools, Dispatcher converter, Repository modernizer, Dev staging and production, Dev sandbox, Local environment",
        "study_materials": "Section 1: Asset workflows (24%): Explain the process to customize OOTB workflows, Identify when to create or customize Asset workflows to implement customer requirements, Describe the purpose of workflow launchers and how to configure them, Differentiate between cloud and on-premise workflows, Describe how to use the Workflow console to monitor status and progress, ; Section 2: Asset organization and the asset console (22%): Demonstrate how to create and organize Assets in Collections, Demonstrate how to organize Assets using Tags, Identify how to leverage OOTB Search Filters and facets, Describe how to Configure and Generate AEM Asset Reports, Describe how to manage User Permissions on Asset Folders, ; Section 3: Asset metadata (24%): Define Metadata schemas, Given a scenario, determine how to adjust the appropriate Metadata schema, Given a scenario, determine how Metadata profiles can be leveraged to meet requirements, Understand how Cascading Metadata schemas work, ; Section 4: Asset types (18%): Describe OOTB features available for asset types, Explain content fragments and content fragment models, Demonstrate how and when to use content fragment variations, ; Section 5: Asset feature sets and capabilities (12%): Describe the common use cases and benefits of using Brand Portal, Describe the common use cases and benefits of using Dynamic Media, Describe options to leverage AEM using Creative Cloud, ",
        "details": "EXAM ID:AD0-E129; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Experience Manager",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, At least 0-12 months of experience using and configuring Adobe Cloud Manager, At least 0-12 months of experience with AEM features and capabilities needed to engage developers to find business solutions, At least 0-12 months of experience configuring, implementing, and managing Continuous Integration/Continuous Deployment tasks, You should be comfortable working in Adobe Managed Services and Adobe Experience Manager as a Cloud Service, and are able to set up Adobe Experience Manager environments and infrastructure., Additionally, you should have:, The ability use AEM products to manage content to drive digital experiences, An understanding of what modules are present, A deeper insight into modules such as Sites, Assets, and Forms",
        "study_materials": "Section 1: Education (22%): Identify AEM features and capabilities, Describe AEM features that meet business needs, Describe procedural concepts necessary to conduct training for content editors, ; Section 2: Architecture (22%): Identify information architecture appropriate to meet business needs using either on-prem or Adobe hosted (Cloud) environment, Describe how AEM connects with third-party services, Identify where to define roles and permissions, Given a scenario, define available caching approaches, ; Section 3: Business Analysis (43%): Given a scenario, identify standard modules of AEM that address customer business problems, Identify content management concepts for AEM modules, Identify typical project stakeholders, Identify realistic collaboration scenarios between involved teams, Given a scenario, describe a correct approach to meet business goals while remaining within budget and/or scope, Identify ways to connect business goals with the development team, ; Section 4: Setup and implementation (13%): Identify best AEM practices to use content components, Given a scenario, identify the correct implementation of a feature, ",
        "details": "EXAM ID:AD0-E126; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:33/50; TIME LIMIT:1 hour 50 mins"
    },
    "Adobe Experience Manager Sites Developer Professional (NEW)": {
        "type": "certificate",
        "category": "Adobe Experience Manager Sites",
        "level": "Professional",
        "job_role": "Developer",
        "prereq": "3-6 months of experience working with the AEM Platform, The ability to perform component development, A basic understanding of the MVC framework, life cycle frameworks and libraries in AEM, Understanding of the AEM development life cycle",
        "study_materials": "Section 1: Configurations (15%): Recognize the purpose of AEM Dispatcher configurations and caching, Determine the correct steps to configure multi-site in AEM, Explain how to create and manage OSGi configurations, Determine the correct steps to manage custom Oak indices, Identify how to create and manage AEM custom logs, ; Section 2: AEM development (37%): Identify how to implement a proxy of a core-component, Given a scenario, identify how to create component functionality including the HTL, models, and services, Given a scenario, determine the correct steps to develop workflows, Given a scenario, outline the purpose of content fragments or experience fragments, Given a scenario, outline the purpose of content fragments or experience fragments, Given a scenario, determine the correct steps to implement editable templates, ; Section 3: Build and deployment (17%): Identify the correct Maven project structure, Given a scenario, identify how to configure projects from archetypes, ; Section 4: Environment maintenance (13%): Identify the purpose of AEM maintenance releases, Identify how to configure AEM across topologies, Given a scenario, identify the issues with the replication process, Identify how to create custom Oak indexes, ; Section 5: Analyzing and Debugging (18%): Given a scenario, identify which log to analyze, Given a scenario, determine how to debug the client libraries, Given a scenario, identify which steps are involved in debugging AEM dispatcher configurations and caching, Given a scenario, determine the steps to debug issues in AEM environments, ",
        "details": "EXAM ID:AD0-E128; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Front-End Developer Expert (NEW)": {
        "type": "certificate",
        "category": "Adobe Commerce Front-End",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have at least 1-3 years of hands-on experience with Adobe Commerce front-end development. You should have the ability to translate the needs expressed by task requirements into a technical solution., Additionally, you should be comfortable using the following technologies:, Adobe Commerce - version 2.4.7, Basic understanding of the front-end structure and layout, Experience and understanding of HTML, CSS (and preprocessors), LESS, JavaScript and UI Components, jQuery, Underscore, Require.JS, Knockout, also PHP templates, DB knowledge and content management, Familiarity with the platform, CMS Blocks, Widgets, CMS pages, Category pages, Product pages, Cart and Checkout, and Account Dashboard area, Basic understanding or knowledge of admin configurations, Knowledge of extending and overwriting styles, layouts, and JS filesExtending parent themes/Theme hierarchyCLI command (cache cleaning, setup: upgrade, indexers, deployment mode) & GruntCaching technologies, client-side browser, understanding storages (Cookies, local storage)Understanding responsive design and media queriesWYSIWYG/Page builderUnderstanding code packagesImplement translationUnderstanding how to work with email templatesUnderstanding of Adobe Commerce Cloud infrastructureBasic understanding of Cloud CLI command tool, Extending parent themes/Theme hierarchy, CLI command (cache cleaning, setup: upgrade, indexers, deployment mode) & Grunt, Caching technologies, client-side browser, understanding storages (Cookies, local storage), Understanding responsive design and media queries, WYSIWYG/Page builder, Understanding code packages, Implement translation, Understanding how to work with email templates, Understanding of Adobe Commerce Cloud infrastructure, Basic understanding of Cloud CLI command tool",
        "study_materials": "Section 1: Theme management (10%): Demonstrate the ability to create a new theme, Demonstrate ability to extend existing themes, Demonstrate ability to customize transactional emails, Demonstrate ability to apply translations,XML, and JS files, ; Section 2: Layout XML & templates (22%): Demonstrate the ability to utilize layout XML instructions, Demonstrate the ability to create new page layouts, Understand the difference between extending/merging and overriding XML, Demonstrate ability to create and customize phtml templates, Apply template security (escaping output), ; Section 3: Styles (12%): Explain the purpose of different LESS files (compiled and partial), Demonstrate the ability to work with LESS files, Implement and customize LESS library components, ; Section 4: JavaScript (36%): Demonstrate the usage of RequireJS, Demonstrate the ability to implement different types of mixins, Demonstrate the usage of Knockout JS, Demonstrate the usage of jQuery widgets, Demonstrate the usage of JS components using Layout XML, ; Section 5: Customizing the Admin panel, Page Builder, and optimizations (20%): Demonstrate the ability to customize Page Builder content, Describe front-end optimization, Describe how to modify and extend the Commerce admin through the admin UI SDK, Define Grunt setup and usage, Utilize additional tools that Commerce Cloud provides, Describe steps to utilize Edge Delivery Service boiler plate, ",
        "details": "EXAM ID:AD0-E727; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:37/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Journey Optimizer Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Journey Optimizer",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "Candidates should be able to:, Validate and proof a message; seed list, Create email, SMS, in app messages and push notifications using predesigned templates/drag-and-drop, Test and validate Journeys, Create journeys and campaigns (email, SMS, and push only), and add basic condition/exclusion in the journey, Know basic personalization using profile attributes and event data, Use subscription lists, Review profile attributes and events (Load a profile in the UI), Understand and use landing pages, Understand when to use different types of journeys/campaigns and have the ability to leverage “Campaigns” feature in Adobe Journey Optimizer for building a one-time email blast, Understand the capability of Data source, Events & Actions, Monitor and Review Journey Reports to track Email Engagements/Bounces/Error rate/Spam rates/Domains Issues, Build & Validate Basic Segment Criteria, Understand email suppression and allow list, Understand Unitary and Business events, Understand and use different Activities in Journey, Basic Debugging - Via Test Mode or Reporting (no query service requried), Gather and document journey requirements with the business, Know best practices around journeys and channels (for example, best time to send, best channel to use, best journey design patterns for different use cases, when to use transactional and marketing message), Understand Deliverability concepts (for example, different Bounces, warming), Understand Frequency, Fatigue rules, Preview Data sets, Basic understanding of Identities, Understand when to use Audience composition, direct mail channel - note that these will be launching sometime in Q4 2023, Understand static and dynamic offer collections and simulation (testing offers), Candidates should also be able to:, Compose an audience (using new audience composer), Import an audience (Upload a CSV audience), Upload and auto-convert HTML for email (new html converter), Create a content experiment, Measure the results of a content experiment, Tag/filter/search journeys, campaigns, and more, Create a fragment from a template, Custom action, Create content in asset essentials, External data source, Offer decisioning (basic knowledge), Basic understanding of XDM (experience data models), Monitor and Review data imports and exports, Creating a content template, Data usage and labeling concepts",
        "study_materials": "Section 1: Campaign and Journey Optimization (48%): Given a scenario, identify how to build a Customer Journey, Given a scenario, determine how to validate a Customer Journey, Given a scenario about after a Journey is run, identify how to evaluate the Customer Journey, Given a scenario, identify when to use unitary event or business event, ; Section 2: Offer Decisioning (12%): Identify how to create a collection of offer, Identify the stages of offer decisioning, Identify how to configure an offer, Given a scenario, identify how to use offer decision activities in content being authored, Given a scenario, identify when to use offer decisioning or personalization at scale, Given a scenario, differentiate between static and dynamic offers, ; Section 3: Content Authoring (20%): Identify how to use asset essentials, Given a scenario, identify how to add personalized fields into emails, Given a scenario, identify the appropriate configuration for the content experiment, Given a scenario, identify how to interpret content experiment, Identify the benefits of using fragments, Identify the types of fragments, Identify how to create an email template, ; Section 4: Foundations of AEP (20%): Given a scenario, determine when to use different types of data Identify where to review profiles attributes and audience membership Differentiate between datasets enabled for profile and datasets not enabled for profile Identify different types of identities supported in Journey Given a scenario, identify when to use a particular audience type Given a scenario, identify the right logic to use for sequential audience Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Identify where to review profiles attributes and audience membership Differentiate between datasets enabled for profile and datasets not enabled for profile Identify different types of identities supported in Journey Given a scenario, identify when to use a particular audience type Given a scenario, identify the right logic to use for sequential audience Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Differentiate between datasets enabled for profile and datasets not enabled for profile Identify different types of identities supported in Journey Given a scenario, identify when to use a particular audience type Given a scenario, identify the right logic to use for sequential audience Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Identify different types of identities supported in Journey Given a scenario, identify when to use a particular audience type Given a scenario, identify the right logic to use for sequential audience Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Given a scenario, identify when to use a particular audience type Given a scenario, identify the right logic to use for sequential audience Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Given a scenario, identify the right logic to use for sequential audience Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Given a scenario, identify how to troubleshoot a data loading issue Given a scenario, identify which data label is appropriate, Given a scenario, identify which data label is appropriate, ",
        "details": "EXAM ID:AD0-E607; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Campaign Classic Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Campaign Classic",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, At least 2 years of extensive Adobe Campaign Classic software experience, Multi-year experience developing marketing campaigns and tactics using digital omnichannel, Experience interpreting/translating business requirements to actionable Campaign deliverables, Experience with marketing metrics such as ROI, click-through rates, and conversion, An understanding of typology application, access management, web technologies and database marketing, An awareness of the legal and ethical guidelines for marketing",
        "study_materials": "Section 1: Campaign management (20%): Apply best practices to build a campaign, Given a scenario, determine the correct campaign template, Explain the importance of typologies, Describe target mappings, Explain how to configure web apps and web forms, ; Section 2: Workflow management (22%): Evaluate a given set of campaign requirements and recommend the course of action, Given a scenario, analyze workflow errors, Given a set of campaign requirements, determine the correct design of a marketing workflow, Apply recommended practices in executing workflows, ; Section 3: Data management (24%): Explain the core concepts of relational databases, Determine the different sources of data that a workflow can access, Identify the correct method to export data, Given a scenario, determine the data investigation method to use, Apply best practices to create lists, Apply the steps to configure a predefined filter, Given a business requirement, identify the appropriate input form, ; Section 4: Delivery management (14%): Apply the steps to create/configure deliveries, Given a scenario, select and set up the appropriate proof audience for approvals, Analyze and interpret delivery audits, ; Section 5: Reporting (12%): Given a scenario, determine the appropriate report(s) to generateInterpret built-in reportsExplain the impact of logs cleanup/purge to reporting, Interpret built-in reports, Explain the impact of logs cleanup/purge to reporting, ; Section 6: Administration (8%): Given a scenario, explain the impact of logs purge to reports, Given business requirements, grant the right authorizations and accesses, Apply the steps to enable SFTP via the control panel, ",
        "details": "EXAM ID:AD0-E327; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Commerce Architect Master": {
        "type": "certificate",
        "category": "Adobe Commerce",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have at least 3-5 year experience leading Commerce development projects and are able to design, integrate, implement, and explain solutions to business problems by utilizing Adobe Commerce along with associated services., Additionally, you should be very familiar with the following activities and technologies:, Extend core features, Configure Adobe Commerce fully, Create full blueprint of how an extension should work, requirements of company to blueprint of how it should work, without having to go into the code, Understand business needs/features, Performance implications of solutions and extensions, Service contracts logic, GraphQL, Understand Composer as a dependency tool, Set up and configure working instance of Adobe Adobe Commerce from scratch, Customize admin dashboard, creating grids and forms, Cache and index management; creating custom index, Create new cache type, Troubleshoot and debug various problems in environment, Extend and manage database schema, Security features, provide secure installation and development extension, Perform server-based services which Adobe Commerce connects (Redis, Varnish configuration management), Aware of best coding standard practice, Coding standards, PSR, SOLID principle, Set up and use Adobe Commerce Services Connector (and associated services)Staging content managementUnderstanding Adobe Commerce defaults, when it is available and not availableBroad grasp of any related Adobe Commerce domainDesign project architectureOptimize performance of Adobe Commerce defaultCreating and modifying B2BAMQP protocol and adapters in Adobe Commerce (S3), Staging content management, Understanding Adobe Commerce defaults, when it is available and not available, Broad grasp of any related Adobe Commerce domain, Design project architecture, Optimize performance of Adobe Commerce default, Creating and modifying B2B, AMQP protocol and adapters in Adobe Commerce (S3)",
        "study_materials": "Section 1: Design (46%): Design and implement optimal solutions for Adobe Commerce to meet business needs, Design logical and technical flows, Customize Commerce features, Integrate Adobe Commerce with external systems and services, Troubleshoot design flows, ; Section 2: Review (32%): Review and refactor existing Adobe Commerce customizations, Utilize Commerce test frameworks throughout the whole workflow, Optimize performance and scalability for Adobe Commerce, Troubleshoot to identify the root cause of issues with Adobe Commerce, Enforce coding standards, ; Section 3: Configure and Deploy (22%): Configure Adobe Commerce and make sure the project is set up optimally, Configure all aspects of Adobe Commerce Cloud, Oversee and improve deployment process, Troubleshoot infrastructure and configuration issues, ",
        "details": "EXAM ID:AD0-E722; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Experience Manager Sites Architect Master": {
        "type": "certificate",
        "category": "Adobe Experience Manager Sites",
        "level": "Master",
        "job_role": "Architect",
        "prereq": "You should have:, At least 3 years of experience as an architect building AEM Sites, The ability to work in Adobe Managed Services and Adobe Experience Manager as a Cloud Service, The ability to set up Adobe Experience Manager environments and infrastructure, Additionally, you should have the ability to perform the following tasks:, Design a software change process for customers (on-prem and cloud), Define a content model for content/assets that can accommodate future requirements, Defines the necessary templates and components based on business requirements, Identify when to use out-of-the-box/functionality/core components versus custom components, Design caching, load balancing and security strategies (Dispatcher, firewall, CDN), Provide high-level effort estimations for initial set up and feature delivery, Establish the function and use cases of internationalization, Define strategies to support multi-site and multi-language, Determine correct configuration mechanisms for software modules, Integrate third-party and Adobe products with AEM, Define migration and upgrade strategies (products and content), Understand deployment methodologies (content and code), Create and deliver infrastructure/deployment diagrams, Determine information models to use with AEM applications, Define authentication and authorization security models and concepts, Determine persistence models based on customers requirements (binary storage, deployment scenario, and so on), Design workflow models for business processes, Establish strategies for platform performance and penetration/security testing, Reuse content across multiple channels, Account for cloud-focused considerations, such as: Auto-scaling, Replication, Asset management, the implications and differences between on-premises and managed services, Cloud Manager, Package management",
        "study_materials": "Section 1: Discovery (18%): Translate high-level business goals to functional requirements, Given a scenario, assess the current state of an architecture, Determine non-functional technical requirements for solution design, ; Section 2: Solution design (44%): Given business requirements, design detailed architecture and solution, Given a scenario, determine appropriate security solutions for a design, Apply procedural concepts to incorporate integration requirements into a solution design, Determine which types of performance and testing requirements should be included in a solution, Apply procedural concepts for designing scalable and resilient architecture, Given a scenario, recommend migration strategies, ; Section 3: Implementation (22%): Given a scenario, identify and resolve design issues revealed during implementation stage, Given a scenario, recommend implementation approaches based on requirements, Determine appropriate methods to use to prototype solutions for proof of concepts, Given a scenario, diagnose and resolve issues encountered during implementation, ; Section 4: Maintenance (16%): Given a scenario, diagnose and resolve issues encountered in production environment, Apply procedural concepts to plan for use of new features and upgrades, Given a scenario, optimize solution for non-functional requirements, ",
        "details": "EXAM ID:AD0-E117; LEVEL:Master (3-5 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:29/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Campaign Classic Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Campaign Classic",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, A minimum of one year of foundational Campaign software experience, An understanding of how to run a query, An understanding of the toolkit that Adobe Campaign offers, Knowledge of how to translate business objectives into workflow, An understanding about targeting and segmenting an audience, Experience with testing and sending a delivery, Hands-on experience setting up cross- channel, personalized workflows and sending deliveries, Experience analyzing and monitoring logs and errors, An understanding of digital marketing concepts and tactics, Basic understanding of automation, metrics, and campaign tactics (capabilities around data management, cloud services, approvals, and so on), An understanding of basic relational databases and of targeting queries in a campaign, Experience with basic HTML and personalization, Subscription service management (opt in/opt out)",
        "study_materials": "Section 1: Build a Campaign (29%): Recognize the different Digital Marketing concepts and objectives, Identify and define key tool features and structure, in relation to the interface, Determine the appropriate delivery template with subdomain to use given Business Requirements, Identify the appropriate delivery preparation or personalization requirements given Business Requirements, Determine the correct target audience among profiles and analyze the results of the expected outcomes, Recommend and apply the correct campaign approval settings, Determine scheduling based on campaign requirements, Recognize where to locate delivery results or output, Differentiate between different error and warning types (delivery, campaign, and workflow level), ; Section 2: Workflow management and platform capabilities (16%): Given a scenario, determine which workflow activities should be selected, Differentiate between campaign and technical workflows, Given a scenario, determine which workflow solution is optimal for continuous, waits, recurring, aborts situations, Identify the new capabilities and features of Campaign V8 compared to previous versions, ; Section 3: Data operations (20%): Determine how to modify columns within a view to test data/output, Describe the purposes of the union, intersection, exclusion, and split workflow targeting activities, Determine the appropriate method to reconcile data, generate a complement, deduplicate, and import data, Given a scenario, identify which data enrichment rule should be used, Given a scenario, determine how to segment an audience and store as a list and cells, Given a scenario, determine the best method to export data to destinations by configuring them, ; Section 4: Delivery configuration (28%): Given a scenario, determine the correct delivery type, Given business requirements, determine how to create templates, Given business requirements, determine the correct delivery properties, Identify and apply OOTB personalization options available for a delivery (link to mirror page, greeting, un-sub link), Given a scenario, determine the appropriate typology rule (control, filtering, pressure, capacity), Identify the cause of a recipients exclusion of a delivery in the log and check delivery diagnostics, Indicate where/how to test delivery content and personalization, Differentiate among the various delivery states that occur during processing and apply actions, ; Section 5: Administration and reporting (7%): Identify common OOTB reports and where to access them, Determine which OOTB report is needed based on reporting requirements, Identify the Descriptive Analysis functionality inside Adobe Campaign, Given a scenario, apply the right authorizations to limit/allow access to Campaign objects, ",
        "details": "EXAM ID:AD0-E329; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Target Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Target",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "At a minimum, the candidate seeking to become certified as a Target Business Practitioner has:, Typically 2+ years experience with optimization platforms, including Adobe Target, Hands-on experience with Adobe Target, Typically 2+ years experience leading/contributing to optimization programs, An understanding of basics of Target/Adobe Marketing Cloud administrative tasks (preferences, user roles and permissions, settings), The ability (1) to understand and translate business KPIs into optimization goals and (2) to make suggestions based on needs assessment, The ability to determine the appropriate Adobe Target activity types based on optimization goals, Knowledge of how HTML and CSS can be used to optimize the user experience, Understanding of JavaScript as a concept, The knowledge of statistical concepts and data analysis as it applies to optimization, An in-depth knowledge of the three-step workflow (experiences, targeting, goals and settings, including all reporting sources), The ability to translate Activity reporting results into actionable insights and suggestions, An understanding of the impact of changing technologies on Target (e.g., ITP, GDPR/CCPA, SPA), An understanding of how Recommendation Activities can be used as a solution, The candidate should be familiar with the following technologies and environments:, Technologies, Marketing cloud debugger / also called Adobe Experience Cloud debugger, Adobe Analytics as a reporting source for Target specifically A4T integration, Browser's console / Browser developer tools such as console, network tab, Network tools in browser, Basic understanding of other Adobe Tools, Developer Console (any web browser), Adobe Target sample calculator, Adobe Audience Manager fundamentals, Adobe Experience Cloud (as audience source for Target), Adobe Experience Manager, Basic knowledge of terminology used in statistics as related to Target, Basic knowledge of cookies behavior, How to read a Solution Design Reference, Environments, Desktop / Website including desktops and mobile devices, Mobile App (basic understanding) / Use of Target for mobile devices, Staging-development, Production, Production environments across mobile devices, tablet devices and desktop devices, Related hosting platforms, Use of target for single page applications, Email",
        "study_materials": "Section 1: Planning and strategy (31%): Identify business KPIs and successfully translate these into optimization goals given key business requirements, Identify opportunities for optimization based on business KPIs and data analysis, Prioritize test ideas based on business needs, level of effort, and potential for lift, Based on the Adobe Sample Size Calculator, determine how variables impact the activity, Construct test hypotheses based on a given scenario and identify hypotheses elements, Analyze a test hypothesis based on a given scenario and identify aspects of a valid hypothesis, Determine KPI-based primary and secondary success metrics, Assess audience requirements, Determine the appropriate analytics reporting sources (i.e., Target or Adobe Analytics), ; Section 2: Configuring, Executing and Managing (42%): Explain the use of Form-Based Experience Composer vs. the Visual Experience Composer, Apply procedures to create an experience using VEC, Apply procedures to create an experience using Form-Based Composer, Apply procedures to manage experiences within an experience composer, Describe the workflow that applies to creating Target Activities, Apply procedures to create an A/B test activity, Apply procedures to create an XT activity, Apply procedures to create an MVT activity, Understand how AP is used for solutions, Apply procedures to create a Recommendation activity, Apply procedures to create an Audience in Target, Apply procedures to set Goals and Settings, Apply procedures to conduct Activity QA, Apply procedures to manage Activities and Audiences within Target, ; Section 3: Analyzing and Reporting (17%): Define and evaluate report settings to help set the elements that appear in a report, Evaluate and compare Adobe Target Sample Size Calculator settings when both planning Target activities and validating Target activities reports, Evaluate and identify common problems associated with A/B testing and how to avoid them, Understand how Automated Personalization Summary reports differ from other reports, Evaluate Experience Performance reports (MVT), Determine the winning variation based on the observed lift, confidence levels and business objectives, ; Section 4: Troubleshooting (10%): Diagnose activity qualification issues, Use browser debugging tools (including Experience Cloud Debugger) to verify implementation, Verify metrics and reporting, ",
        "details": "EXAM ID:AD0-E406; LEVEL:Expert (1-3 years experience); COST:$225 USD / $150 USD (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:46/68; TIME LIMIT:2 hours 16 minutes"
    },
    "Adobe Workfront Core Developer Expert": {
        "type": "certificate",
        "category": "Adobe Workfront Core",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have at least 18-24 months experience with Adobe Workfront, and should be able to:, Navigate the Workfront system, understanding where its functionality resides, Configure all aspects of the system, Discuss requirements with customers and translate those into a viable solution, Elicit and modify existing process for improvement in a collaborative way, Understand and apply the marketing and PMO uses cases, Recommend and create reports that support customer processes",
        "study_materials": "Section 1: Core system administration and setup (17%): Given a scenario, describe ways to effectively share permissions and access., Given a scenario, identify when a group status versus a system status should be used., Given a data set, demonstrate the capabilities of kickstarts., Given a scenario, identify best practices for auto-provisioning users., Given a scenario, demonstrate how Groups and Teams within a users profile can affect what can be seen or done within Workfront., Given a scenario, recommend a Boards configuration to meet a custom requirement., Given a scenario, identify best practices for group administration., ; Section 2: Intake, custom forms, and project initiation (13%): Given a scenario, identify the configuration areas needed to support the work allocations., Given a scenario, identify how a value is passed to a project custom form., Given a scenario, describe what must be done to address reporting and calculation errors., Given a scenario, identify supporting elements that lend themselves to templates., Given a scenario with multiple forms, determine actions to control access, visibility and dependency., Given a scenario with calculated fields on multi-object forms, identify the correct formula., ; Section 3: Strategic functionality: portfolio and program management, resource management (13%): Given a scenario, define tools to capture changes in the project scope., Given a scenario, create a view that identifies within a portfolio whether a project meets the average level of requisite criteria to be executed., Given a scenario, describe ways to manage risk qualitatively or quantitatively., Given a scenario, provide a mechanism to ensure the highest priority projects are set up to be resourced appropriately., Given a scenario, provide a mechanism to ensure that projects are fully staffed by using Resource Management tools., Given a scenario, use Resource Management tools to determine why a user is overallocated., ; Section 4: Document management and proof (13%): Given a scenario, demonstrate when to utilize document management versus proofing, Given a scenario, identify best practices for using the proofing viewer, settings, and markup functionality, Given a scenario, demonstrate how to edit and set permissions on a file, Given a scenario, demonstrate how to set up external document storage with security restrictions, Given a scenario, set up a connection to AEM as a Cloud Service or AEM Assets Essentials., ; Section 5: Reporting (11%): Given a scenario, describe ways to combine multiple columns of data into a single column., Given a report or filter, demonstrate the merits of using wildcard values., Identify how to report on parent-to-child relationships using native reporting., Given a scenario, describe how reporting facilitates efficient execution of work., Given a scenario, illustrate Workfront Reporting to monitor and improve user adoption., Given a scenario, determine how a field type would render on a report. (Field types include: rich text, images, multi-select), ; Section 6: Methodology / best practices / use cases (22%): Given a scenario within Workfront, demonstrate functionality for setting up tracking of deliverables that are part of a single campaign., Given a scenario within Workfront, demonstrate functionality around strategic prioritization and justification of work., Given a scenario within Workfront, demonstrate functionality around financials, utilization, forecasting, billing rates/records., Given a scenario within Workfront, demonstrate functionality around setting up workflow and approvals., Given a scenario, recommend a framework for governance around system administration when expanding a clients instance., Given a scenario, identify areas for consideration when expanding a clients instance to enable additional teams to work together., Given a scenario using Workfront Boards, identify native features to show progress., Given a scenario, recommend a framework for governance around system and group administration., ; Section 7: Business consulting (11%): Given a scenario, describe the process needed to fully support effort of implementing Workfront in a cross-functional department., Given a scenario, explain how to adapt an existing Workflow to meet a recent change in a critical, inflight business process., Given a scenario, identify configuration settings that are most difficult to change to a given instance., Given a scenario, identify the key considerations of change management for a Workfront implementation, Given a scenario where a client has multiple teams, provide a recommendation to increase efficiency., ",
        "details": "EXAM ID:AD0-E907; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:35/53; TIME LIMIT:1 hour 46 mins"
    },
    "Adobe Experience Manager DevOps Engineer Expert": {
        "type": "certificate",
        "category": "Adobe Experience Manager DevOps",
        "level": "Expert",
        "job_role": "Engineer",
        "prereq": "You should have:, At least 1-3 years of experience using and configuring Adobe Cloud Manager, At least two years of experience configuring, implementing, and managing Continuous Integration/Continuous Deployment tasks, Additionally, you should be familiar with the following technologies and environments:, Cloud Manager, Adobe IO CLI, Git CLI, Cloud transition tools, Dispatcher convertor, Repository modernizer, Dev staging and production, Dev sandbox, Local environment",
        "study_materials": "Section 1: Configure Adobe Experience Manager (18%): Determine the correct method to configure fundamental Adobe Experience Manager settings, Given a scenario, troubleshoot Adobe Experience Manager issues, Determine the correct method to configure OSGi, ; Section 2: Operate Cloud Manager and Cloud Manager API (20%): Determine the correct method to manage Cloud Manager Environments settings via UIDetermine the correct method to provision programs and environments on Cloud ManagerDetermine the correct method to migrate to Adobe Experience Manager as a Cloud ServiceDetermine the correct method to set up integrations on Adobe I/O, Determine the correct method to provision programs and environments on Cloud ManagerDetermine the correct method to migrate to Adobe Experience Manager as a Cloud ServiceDetermine the correct method to set up integrations on Adobe I/O, Determine the correct method to migrate to Adobe Experience Manager as a Cloud ServiceDetermine the correct method to set up integrations on Adobe I/O, Determine the correct method to set up integrations on Adobe I/O, ; Section 3: Configure the web proxy infrastructure (12%): Determine the correct method to manage Dispatcher configurations, Given a scenario, troubleshoot caching issues, ; Section 4: Build and deployments (28%): Determine the correct method to manage Cloud Manager deployments, Given a scenario, analyze the state of a Cloud Manager pipeline, Determine the correct method to manage content packages across multiple Adobe Experience Manager instances, Determine the correct method to make changes to Maven files to support pipelines, ; Section 5: Monitor and report on quality metrics (14%): Determine the correct method to collect performance metrics and reports, Determine the correct method to scale infrastructure, ; Section 6: Operate the Admin Console (8%): Determine the correct method to submit a support request in the Admin Console, Determine the correct method to configure federated SSO and sync Adobe Experience Manager users and groups, ",
        "details": "EXAM ID:AD0-E124; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:30/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Customer Journey Analytics Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Customer Journey Analytics",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "",
        "study_materials": "Section 1: Components (30%): Translate business questions into relevant components, Create a subset of data using appropriate components and filters, Build non-admin components to address business questions, ; Section 2: Reporting (32%): Determine appropriate visualizations or tables to address business questions, Determine which data view to use based on data sources, identities, and date ranges, Determine how to use and apply date ranges, ; Section 3: Distribution (12%): Schedule and share reports with key stakeholders, Curate fields available in a particular report or dashboard, Organize projects in a logical manner, ; Section 4: Data Analysis (26%): Perform exploratory analysis and interpret results to provide insights, Evaluate audiences to share with other AEP tools, Choose correct components for analysis, ",
        "details": "EXAM ID:AD0-E608; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:36/50; TIME LIMIT:1 hour 40 mins"
    },
    "Adobe Analytics Developer Expert": {
        "type": "certificate",
        "category": "Adobe Analytics",
        "level": "Expert",
        "job_role": "Developer",
        "prereq": "You should have experience as an implementation consultant in a hybrid role with about 2 years experience in Adobe Analytics implementation. You act as the bridge between IT and the business, translate the business requirements into a technical solution (SDR), and, based on requirements provided by the analyst, understand which type of variable is needed, where and how to collect the data, design the data model (data layer), configure and maintain the tag management solution., You, as the Analytics Developer, rarely implement the tags on the page; instead, they are implemented by IT or the system integrator., You should be familiar with the following tools and environments:, Tools:, Adobe Experience Platform Launch (Adobe Launch), Debugging tools relevant to Adobe Analytics (Packet monitor such as Adobe Debugger, browser developer tools, Charles), Adobe Analytics Admin Console report suite settings, Basic Workspace knowledge, Web development tools, code editor and mobile debugging tools, Adobe Auditor, Processing rules, Classification rules – regex-based classification rules, JavaScript errors, Basic understanding of the available Adobe Analytics related APIs, Adobe I/O integration, Environments:, Front-end web development environments, Knowledge of mobile application (limitations and differences, for example, why it is different than web), The field of digital marketing, Minimal knowledge of backend development environments including PC, Mac, Android/iOS operating systems (basic operations, not development)",
        "study_materials": "Section 1: Understanding Analytics in the Adobe Experience Cloud Ecosystem (10%): Demonstrate knowledge on utilizing the Adobe Experience Cloud ID, Demonstrate understanding of Adobe Launch, Demonstrate understanding of common integrations across the Adobe Experience Cloud Ecosystem, ; Section 2: Strategy and design based on a solution design reference (SDR) (6%): Interpret a Solution Design Reference to develop efficient code for data capture, Use the Tech Spec for populating data objects, ; Section 3: Analytics Implementation and Configuration (36%): Determine which environment to deploy Adobe Analytics Code, Execute a minimal deployment code for Analytics tracking, Configure various components within Adobe Analytics UI, Configure Adobe Analytics report suite and variable settings, Utilize a data layer within a deployment, Execute advanced tracking features such as link tracking and product strings, ; Section 4: Tag management systems (20%): Enumerate requirements to deploy Adobe Experience Platform Launch in Adobe Analytics, Apply processes to configure website tagging with Adobe Launch, Enumerate requirements to enable extensions and Adobe Launch, Create rules and data elements, ; Section 5: Mobile services (8%): Apply processes to configure and execute a base pre-deployment code for mobile, Demonstrate understanding of processing rules and mobile services, ; Section 6: Testing, validation, and troubleshooting (20%): Troubleshoot JavaScript errors, Troubleshoot Adobe Analytics variables, Recommend testing and debugging best practices, Troubleshoot an Adobe Analytics server call across its lifecycle (that is, from beacon request to showing up in the report), ",
        "details": "EXAM ID:AD0-E209; LEVEL:Expert (1-3 years experience); COST:$225 (global) and $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:31/50; TIME LIMIT:2 hours"
    },
    "Adobe Advertising DSP Business Practitioner Professional": {
        "type": "certificate",
        "category": "Adobe Advertising DSP",
        "level": "Professional",
        "job_role": "Business Practitioner",
        "prereq": "You should have:, 6+ months experience with Adobe Advertising, Experience in planning and or measuring key performance indicators in media buying software, You should also be familiar with the following tools and technologies:, Ad testing/debugging software (VAST INSPECTOR, Chrome developer tools), Analytics tools (Adobe Analytics, Google Analytics), Third-party tagging software (Sizmek, Google tag manager), Third-party media quality tools (IAS, MOAT), Major browsers, Ad exchanges, SSPs, and DMPs",
        "study_materials": "Section 1: Setting up campaigns (42%): Given the needs of a campaign, determine the strategy for that campaign, Given a scenario, create a new campaign, Given a scenario, create a package, Apply procedural concepts for creating and applying targeting to placements, Apply procedural concepts for attaching ads to placements, Given a scenario, duplicate and edit a campaign, Apply procedural concepts required to set up Private and On demand inventories for a campaign, ; : Given the needs of a campaign, determine the strategy for that campaign, Given a scenario, create a new campaign, Given a scenario, create a package, Apply procedural concepts for creating and applying targeting to placements, Apply procedural concepts for attaching ads to placements, Given a scenario, duplicate and edit a campaign, Apply procedural concepts required to set up Private and On demand inventories for a campaign, ; Section 2: Running and optimizing campaigns (22%): Apply procedural concepts to ensure that campaigns are running correctly, Apply procedural concepts to optimize a campaign, Apply procedural concepts to troubleshoot a campaign, Given a scenario, manage integrations with in-platform solutions, ; Section 3: Reporting and analyzing (26%): Given a scenario, read data within the platform, Given a scenario, create and read custom reports, Implement changes to a campaign, Given a scenario, evaluate the performance of a campaign, Apply procedural concepts for attributing performance to a campaign, ; Section 4: Supplying recommendations for campaigns (10%): Given a scenario, provide updates to clients based on a campaign, Given a scenario, adjust campaign strategy based on campaign performance, ",
        "details": "EXAM ID:AD0-E502; LEVEL:Professional (0-12 months experience); COST:$125 (global) / $95 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:44/69; TIME LIMIT:2 hours 18 mins"
    },
    "Adobe Marketo Engage Business Practitioner Expert": {
        "type": "certificate",
        "category": "Adobe Marketo Engage",
        "level": "Expert",
        "job_role": "Business Practitioner",
        "prereq": "Approximately 18 months of experience with Adobe Marketo Engage features and capabilities needed to create marketing campaigns and utilize customer behavior data., You should be a marketer with experience in:, Building, launching and analyzing campaigns, Working with underlying email behavior and technologies including HTML, integrations, databases, and CRM, Additionally, you should be familiar with the following tools and technologies:, Adobe Marketo Engage, Excel and CSV file format, API concepts, CRM basics, Social media platforms like Facebook and LinkedIn, Microsoft Office, Basic HTML",
        "study_materials": "Section 1: Administration and Maintenance (12%): Determine mapping process between Marketo and CRM, Identify what happened to an asset using the Audit Trail, Recognize differences between users and roles, Given a scenario, identify the best fit for using workspace and partitions, Identify CRM platforms with native Marketo synchronization, Given a scenario, locate where information is referenced, ; Section 2: Marketing Activities/Campaign Management (46%): Demonstrate an understanding of Smart Campaigns, logic, constraints and flow steps, Given a scenario, define the next step, Identify the root cause of a problem, Interpret the relationship between programs, channels, tags and period cost, Demonstrate/apply the correct configuration to Engagement Programs, Give examples of usage for different types of tokens, Summarize the utility of Webhooks in Marketo and how they are used, Identify and apply the appropriate use of the PMCF, Explain the benefits of Global Assets and how to use them, Demonstrate the capabilities of forms, Perform and analyze an A/B test strategy, Identify where a program or asset has been referenced with ‘Used By, Troubleshoot communication limits, Use Webinar provider information in an event program, ; Section 3: Lead Management (12%): Outline the key decision points in defining the lifecycle model, Apply best practices around lead scoring, Implement the appropriate interesting moments, Interpret the lead activity log, Given a scenario, identify the creation source, ; Section 4: Data Management (10%): Demonstrate how to set up a data management program, Analyze an instances data quality, Identify a few key pieces of Marketos data retention policy as it relates to smart lists, Summarize how segmentation works, ; Section 5: Reporting (4%): Given an outcome of a campaign, determine how to set up a program to provide the best reporting, Given a scenario, be able to investigate and assign the appropriate acquisition program, ; Section 6: Best Practices (16%): Demonstrate the relevance of lead scoring in marketing and sales collaboration, Illustrate the benefits of the folder structure and naming conventions, Apply best practices around A/B testing, Explain the process to perform a quality check on any Marketo program, Explain the process to perform a quality check on an email, ",
        "details": "EXAM ID:AD0-E559; LEVEL:Expert (1-3 years experience); COST:$225 (global) / $150 (India); LANGUAGE(S):; DELIVERY:Online proctored (requires camera access); PASSING SCORE:32/50; TIME LIMIT:1 hour 40 mins"
    }
}